{"version":"1","records":[{"hierarchy":{"lvl1":"Introduction"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Introduction"},"content":"Welcome to MCEN 3030: Computational Methods!\n\nThis course is offered by The University of Colorado Boulder Department of Mechanical Engineering, taught by Professor Jeremy Koch in the spring 2026 semester. We will learn about many of the mathematical algorithms that power engineering calculations. This is an exciting topic, as it allows us to study problems that go beyond what we can do with pencil and paper.","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Introduction","lvl2":"Scope"},"type":"lvl2","url":"/#scope","position":2},{"hierarchy":{"lvl1":"Introduction","lvl2":"Scope"},"content":"This is an introductory course with a large amount of coding, though it is arguably more of an “applied math” course than a programming course. Most of the heavy lifting will be done with for, while, if, and thoughtful use of arrays. We will build our own versions of optimization algorithms, finite-element calculators, and differential equation solvers and that will allow us to better understand: what information is needed in these methods, what errors might we see, what the results mean, and what can we do if our approach is not working.\n\n\n\nNonlinear/chaotic differential equations can be “solved” using the numerical techniques learned in this class (Runge-Kutta Method). Here is a phase diagram, inspiration and equation from: Njah “Synchronization via active control of parametrically and externally excited Φ6 Van der Pol and Duffing oscillators and application to secure communications.” Journal of Vibration and control 17.4 (2011): 493-504. Plot created with Julia’s “Plots” package (after calculating the trajectories using Runge-Kutta).","type":"content","url":"/#scope","position":3},{"hierarchy":{"lvl1":"Introduction","lvl2":"Some policy highlights"},"type":"lvl2","url":"/#some-policy-highlights","position":4},{"hierarchy":{"lvl1":"Introduction","lvl2":"Some policy highlights"},"content":"We will use the \n\n“flipped classroom” model and will cultivate a classroom environment that is highly collaborative.\n\nYou can choose what language you use. MATLAB, Python, or Julia (ask me about others). AI will help you get your feet underneath you, and I have built \n\na page that includes pretty much all the commands you will need this semester, in those three languages. (Again, let’s talk about other languages.)\n\n“AI will help you get your feet underneath you”? Yep, you have a \n\ngreen light to use AI on the homework and project in this course. However, make sure to \n\nuse it responsibly -- the exams are pencil and paper only, no electronics.","type":"content","url":"/#some-policy-highlights","position":5},{"hierarchy":{"lvl1":"Introduction","lvl2":"Some content highlights"},"type":"lvl2","url":"/#some-content-highlights","position":6},{"hierarchy":{"lvl1":"Introduction","lvl2":"Some content highlights"},"content":"We will use GitHub Classroom. GitHub “repositories” are a very standard way to share code, and this organization step might be one of the most important lessons of the semester.\n\nWe will learn how to fit models, including nonlinear ones, to experimental data.\n\nWe will do an introduction to machine learning, including a project.\n\nWe will solve coupled nonlinear differential equations, including those that describe \n\nmathematical chaos. (Plot above is an example.)","type":"content","url":"/#some-content-highlights","position":7},{"hierarchy":{"lvl1":"Introduction","lvl2":"How to use this site"},"type":"lvl2","url":"/#how-to-use-this-site","position":8},{"hierarchy":{"lvl1":"Introduction","lvl2":"How to use this site"},"content":"I prepared this site to augment the learning that occurs elsewhere -- a rephrasing of the lecture (video) material that may clarify things, and a reference if you are quickly looking for an equation. It is not as detailed as a textbook and does not have many examples.\n\nIt is a living document that will have things added and removed frequently. As such, I do NOT recommend forking this repository (if you know how to do this) -- if you are reading this early in the semester, there could be 50% more material by the end of the semester, I probably have incomplete pages floating around, and I might decide to eliminate some content in favor of adding other content.\n\nCourse units are in the panel on the left, and clicking them will open a drop-down menu. Each item in that drop-down menu is a short reading. The readings are mostly about the motivation and the math, though sometimes code is included. Expect to read 1-3 of these before each class period (alongside watching the videos).\n\nBecause this is a “polyglot” course, most of the times that code is referenced, it will be included in an environment like that below. You can choose the tab for your language, then see the code. In the top-right corner of each coding environment, you can choose an icon to copy that code block, and then you can paste it into your working environment and run it. Please confirm the code does what you think it does! Maybe I made a mistake!\n\nIn the top-right corner of this site is a search bar. So, if you are looking for references to Taylor Series within this site, you can search for it up there.\n\nAt the end of each unit (the topics on the left) is a “Summary” page. As part of this, questions like “how would you do this?” are included... this is your study guide for the exams! Exam questions will be about using the functions we write this semester: you will need to create the inputs, understand and call the functions, and handle the outputs. :::{caution}\nOveruse of AI might keep you from understanding the inputs/outputs of the functions, and you might struggle with the auxiliary tasks, e.g.: creating an input array of evenly spaced numbers, preallocating space for the output array, defining a function. You need to figure out how to use AI responsibly. [I give recommendations here](responsible-AI.md).\n::: \n\nf=@(x,a) sin(x)+a;\n\nf=lambda x,a: np.sin(x)+a\n\nf=(x,a) -> sin(x)+a","type":"content","url":"/#how-to-use-this-site","position":9},{"hierarchy":{"lvl1":"Introduction","lvl2":"A brief comment"},"type":"lvl2","url":"/#a-brief-comment","position":10},{"hierarchy":{"lvl1":"Introduction","lvl2":"A brief comment"},"content":"This webpage is hardly a book, more like a pamphlet, and it alone is not going to get you to succeed in this course. We additionally have lecture videos, and more importantly, in-class work and homework that is going to go much further towards getting you to understand the content.\n\nThat being said, this webpage is hopefully going to be a resource for you, and you should read the relevant sections I point before class and reference this first when you have questions (use the search bar!). I estimate the total word count on all these pages to be about 30000... which sounds like a lot, but a textbook has about 300 words per page, so this is something like 100 pages. Over the course of our 15 weeks together, it is incredibly reasonable to ask you to read and digest this volume of information -- less than 10 pages per week!\n\nNote that, in my \n\ntips for success page, I comment that:\n\nYour ability to focus is correlated with your career success. So: settle in and focus as you read for a few minutes. Develop that “muscle”.\n\nAI is depriving students of their ability to focus and take in the details, instead providing quick and easy “summaries”. Every page on this site is basically already summary, don’t be summarizing a summary!\n\nPassivity is getting you nowhere. Think about the material after you read a section, get a pencil out and derive something yourself, get curious (“why doesn’t this work?”), do some digging, connect the dots.\n\nOne of my big goals this semester is to empower students.\n\n\n\nA quick example of where you might take your wisdom after completing MCEN 3030. (Sorry, won’t cover this in class!) \n\nAgents.jl is a Julia package that can implement flocking/swarming models -- really difficult to understand with pencil and paper, as there are often hundreds or thousands of entities interacting in these systems. One of their examples implements a forest fire model -- unfortunately very relevant to us in Colorado.","type":"content","url":"/#a-brief-comment","position":11},{"hierarchy":{"lvl1":"Course Policies"},"type":"lvl1","url":"/course-policies","position":0},{"hierarchy":{"lvl1":"Course Policies"},"content":" **Author:** Jeremy Koch \n\nFor more details about course policy, see the official course syllabus on Canvas.\n\nAttention\n\nThis document, and the course syllabus, cannot outline explicit policies for every eventuality. I reserve the right to modify any course policy in response to significant events over the semester. This could include, but is not limited to: excessive class cancellations due to weather or pandemic, changes in the accessibility of AI tools (e.g. if free versions disappear), widespread academic dishonesty, students not making effective use of class time, etc.\n\nKeep in mind, your success is my success, and so you should have nothing to worry about here if you approach this class earnestly.","type":"content","url":"/course-policies","position":1},{"hierarchy":{"lvl1":"Course Policies","lvl2":"Grade Breakdown"},"type":"lvl2","url":"/course-policies#grade-breakdown","position":2},{"hierarchy":{"lvl1":"Course Policies","lvl2":"Grade Breakdown"},"content":"10% in-class problems\n15% homework repository5% homework repository -- commit history5% ML project20% midterm 120% midterm 225% final exam0.2% email professionalism (bonus points)\n\n=100.2%\n\nin-class problems:\n\nThese will be completed in groups of three towards the beginning of each class period and will be mostly tech-free. An example problem is: compute the first two iterations of an algorithm by hand. The goal is for you to get a feel for how the algorithm works, which will allow you to better understand how to translate it to code. Further, it will give you a check to see if your code is working: in the above case, an if iteration==2, print x within your loop might be a good thing to check out.\n\nBigger picture: These points represent your active participation in discussions with your colleagues, which I believe is the most productive way to learn the course material. Submission will occur before the end of the class period. There will be no option to submit these late -- if you missed the class discussion, you missed the learning opportunity and will not receive credit for it. However, we will drop a small number of these assignments, likely 4, in the final grade calculation, and so you will not be penalized if you miss a small number of classes due to illness, travel, or a need to temporarily prioritize another course. Note that you are not excused from the content if you miss class -- it won’t affect your grade to miss a few classes, but you are still expected to get information from a classmate.\n\nCaution\n\nI do not approve of prioritizing another course, by the way, but you are adults and can make that call. I also do not recommend trying to be strategic with these absences -- save them for when you are sick. If you miss our class early in the semester to study for another class, then are sick late in the semester, that stinks. If you are sick for more than two weeks of the semester, please contact the Dean of Students.\n\nhomework repository:\n\nOver the course of the semester we will learn about and write functions/scripts that implement approximately 20 computational ideas. This is your homework (though we will almost always have the opportunity to begin this work in the classroom where your colleagues, a TA, or myself will be around to help you talk through your ideas). Homework will be submitted via GitHub Classroom, mimicking the development of an actual code repository.\n\nWe will additionally monitor the commit history over the course of the semester. A student who consistently submits one (perfect) version of the code shortly before the deadline is almost certainly misusing AI\n\nmachine learning project:\n\nWe will get some authentic experience in doing a machine learning calculation. We will briefly introduce the field, describing some of the strategies but not necessarily diving deeply into the math. MATLAB has a machine learning toolbox, Python has several packages and has the most robust machine learning community (Scikit-learn is my recommendation, but PyTorch and TensorFlow are out there too), Julia has Lux and Flux.\n\nI cannot get TensorFlow to work on my machine, it crashes the kernel.\n\nThere may be intermediate milestones such as submitting a topic for approval and including your LLM prompting. More details will be posted.\n\nAI use is encouraged, tutorial use is encouraged, but plagiarism is not. An example of plagiarism in this context is: taking someone’s completed analysis published in a blog somewhere and submitting it as your own work. Plagiarism in this course is completely unacceptable and will lead to immediate failing grade for the course and submission to the honor council, regardless of your grade in the other aspects of the course.\n\nexams:\n\nThis course will have three exams -- two midterms that will occur during class, and a final exam. The midterms are \n\ntentatively scheduled, the \n\nfinal exam time has been cemented by the university.\n\nThe exams will be entirely pencil-and-paper, no electronics (including calculators). You will be allowed a small set of notes (specifics on this added later). The most important aspect of these notes will be the inputs, outputs, and descriptions of the functions written in your homework.\n\nExam questions will likely be something like: Achieve a task by “calling” a function. It will not be made explicit what function to call -- you will make that judgment based on your understanding of the function inputs, outputs, and limitations. There may be some additional\n\nemail professionalism:\n\nIn the past year, have observed an uptick in emails that, at their core, are attempts to circumvent course policy. I am glad to receive emails from you in general, don’t be discouraged to send them to me, but I would like you to think twice before:\n\n... sending an email with just “question” (or something similar) in the subject line. See \n\nhow to write emails for this class.\n\n... asking me to move deadlines/exams because you have a project or exam in another class.\n\n... asking me if there will be a curve.\n\n... asking me to accept a late submission without penalty, including if you “forgot” or “thought you had already submitted it”.\n\n... asking me for extra credit.\n\n... asking me when the final is. \n\nIt has been scheduled already, and it takes place in the classroom unless you hear otherwise.\n\n... asking me to round up your grade.\n\n... or similar requests. This has become a big enough concern that I am implementing the following policy: everyone currently has 0.2% bonus points in the class, but if you send any of the above types of emails, or similar, you lose it. This may not seem like a lot, but FYI I do not round an 89.9% to an A-... I might round an 89.99% but no promises. There has to be a cutoff somewhere, and for a person who has sent only succinct, organized emails all semester, without attempting to circumvent course policy, that cutoff is effectively no higher than 89.8% (once this bonus is added).\n\nIf you have an acute medical situation or travel associated with a university-sanctioned team (e.g., CU lacrosse or the Wind Energy Team), please do send the email.","type":"content","url":"/course-policies#grade-breakdown","position":3},{"hierarchy":{"lvl1":"Course Policies","lvl2":"Class Disruption"},"type":"lvl2","url":"/course-policies#class-disruption","position":4},{"hierarchy":{"lvl1":"Course Policies","lvl2":"Class Disruption"},"content":"This is a “flipped classroom” that involves discussion between students and computer use. The classroom will be lively -- it is imperative that we remain focused. If you are seen to be checking social media/the news/sports scores, playing games, watching non-course-related videos, listening to music, etc. ... basically if you are using class time for things not related to class ... you will be asked to leave the classroom and your in-class score for the day will be a non-droppable zero. This includes phone use.\n\nCaution\n\nA rough calculation: after dropping a few, your grade on the “in-class” portion of the class will be based on something like 20 in-class problems this semester. A zero on one will drop your overall grade by about 0.5%.","type":"content","url":"/course-policies#class-disruption","position":5},{"hierarchy":{"lvl1":"Course Policies","lvl2":"Late Work"},"type":"lvl2","url":"/course-policies#late-work","position":6},{"hierarchy":{"lvl1":"Course Policies","lvl2":"Late Work"},"content":"Work submitted after the deadline will be subject to a 50% penalty. However, you may submit\n\nComputer and internet issues are not a valid excuse for submitting late work. If you would like to “play chicken” with the deadline, then you must accept that might lose. My recommendation is to plan to submit early which will give you a buffer in case you run into trouble.\n\nForgetting to submit work does not absolve you from these penalties. “I thought I submitted it” is not going to sway me. Please do not submit timestamps “proving you did it on time” or email me your work after the submission portal is closed in hopes of receiving some credit. You can consider the zero on the assignment to be a penalty for not confirming that your work was submitted.\n\nSome of the best advice I can give you is: get the easy stuff right. Submitting your work on time (and confirming it was submitted) is an example of “the easy stuff”. If you are going to do the hard work of completing the assignment, don’t mess up the easy work of submitting on time.","type":"content","url":"/course-policies#late-work","position":7},{"hierarchy":{"lvl1":"Course Policies","lvl2":"AI Policy"},"type":"lvl2","url":"/course-policies#ai-policy","position":8},{"hierarchy":{"lvl1":"Course Policies","lvl2":"AI Policy"},"content":"This course allows responsible use of AI on homework and projects. AI is prohibited on in-class activities (unless explicitly stated to the contrary for a specific assignment) and on exams.\n\nThe purpose of this policy is to\n\n“\n\nResponsible use” is a judgment made by the instructional staff and is described in the linked page. Students who are suspected of irresponsible use may be asked to schedule a meeting wherein they will explain their code.\n\nThe penalty for AI misuse may include a zero on the assignment, failure of the course, and/or a report to the honor council.","type":"content","url":"/course-policies#ai-policy","position":9},{"hierarchy":{"lvl1":"Course Policies","lvl2":"Final Grade Policy"},"type":"lvl2","url":"/course-policies#final-grade-policy","position":10},{"hierarchy":{"lvl1":"Course Policies","lvl2":"Final Grade Policy"},"content":"Students are assessed based on the work that they have submitted over the course of the semester. I cannot and do not take into consideration your intended graduation date, financial aid, sports eligibility,","type":"content","url":"/course-policies#final-grade-policy","position":11},{"hierarchy":{"lvl1":"Course Policies","lvl2":"Further policies..."},"type":"lvl2","url":"/course-policies#further-policies","position":12},{"hierarchy":{"lvl1":"Course Policies","lvl2":"Further policies..."},"content":"... can be found in the full syllabus on Canvas. ## A brief word on this course structure ","type":"content","url":"/course-policies#further-policies","position":13},{"hierarchy":{"lvl1":"Tentative Schedule"},"type":"lvl1","url":"/course-schedule","position":0},{"hierarchy":{"lvl1":"Tentative Schedule"},"content":"Week 0:       8 Jan\n\nCourse Intro\n\nWeek 1:       13-15 Jan\n\nTuesday 13 Jan: Programming intro\n\nThursday 15 Jan: Programming intro 2\n\nWeek 2:       20-22 Jan\n\nTuesday 20 Jan:\n\nRoot-finding Methods Intro\n\nBisection Method\n\nThursday 22 Jan:\n\n1D Newton-Raphson\n\nFriday, 23 Jan: homework due\n\nWeek 3:       27-29 Jan\n\nTuesday 27 Jan:\n\n2D Newton-Raphson\n\nThursday 29 Jan:\n\nSecant Method\n\nWeek 4:       3 - 5 Feb\n\nTuesday 3 Feb:\n\nLU Decomposition\n\nThursday 5 Feb:\n\nSingular Value Decomposition\n\nFriday, 6 Feb: homework due\n\nWeek 5:       10-12 Feb\n\nTuesday 10 Feb:\n\nLinear fitting\n\nThe meaning of R^2\n\nThursday 12 Feb:\n\nNonlinear fitting\n\nWeek 6:       17-19 Feb\n\nTuesday 17 Feb:\n\nGolden Search\n\nSteepest Ascent\n\nThursday 19 Feb:\n\nSummaries\n\nFriday, 20 Feb: homework due\n\nWeek 7:       24-26 Feb\n\nTuesday, 24 Feb: MIDTERM 1 in class (tentative)\n\nThursday, 26 Feb: no class, Midterm Reading Day\n\nmachine learning project introduction\n\nWeek 8:       3-5 Mar\n\nTuesday 3 Mar:\n-asfd\n\nThursday 5 Mar:\n-sadf\n\nWeek 9:       10-12 Mar\n\nTuesday 10 Mar:\n\nasfd\n\nThursday 12 Mar:\n\nasdf\n\nFriday, 13 Mar: homework due\n\nSpring Break Week:       16-20 Mar\n\nno class\n\nWeek 10:       24-26 Mar\n\nTuesday 24 Mar:\n\nasdf\n\nThursday 26 Mar:\n\nasdf\n\nWeek 11:       31 Mar-2 Apr\n\nTuesday 31 Mar: Numerical Integration\n\nThursday 2 Apr: Monte Carlo Methods\n\nFriday, 3 Apr: homework due\n\nWeek 12:       7-9 Apr\n\nThursday, 9 Apr: MIDTERM 2 in class (tentative)\n\nWeek 13:       14-16 Apr\n\nTuesday, 14 Apr:\n\nOrdinary Differential Equations Intro\n\nEuler’s Method\n\nThursday, 16 Apr:\n\nCoupled Equations\n\nWeek 14:       21-23 Apr\n\nTuesday 21 Apr:\n\nPartial Differential Equations\n\nFriday, 24 Apr: homework due\n\nFinals Week:       28-30 Apr\n\nSection 010: Thursday, 30 Apr 10:30AM - 1PM\n\nSection 020: Tuesday,  28 Apr 4:30–7PM(Yes, the earlier section has their final on the later date.)","type":"content","url":"/course-schedule","position":1},{"hierarchy":{"lvl1":"The Flipped Classroom"},"type":"lvl1","url":"/flipped-classroom","position":0},{"hierarchy":{"lvl1":"The Flipped Classroom"},"content":" **Author:** Jeremy Koch ","type":"content","url":"/flipped-classroom","position":1},{"hierarchy":{"lvl1":"The Flipped Classroom","lvl2":"Motivation"},"type":"lvl2","url":"/flipped-classroom#motivation","position":2},{"hierarchy":{"lvl1":"The Flipped Classroom","lvl2":"Motivation"},"content":"I am excited about this semester because we are going to use the “flipped classroom” format for this course.\n\nMy main motivation is this: I have observed an increase in student passivity in the past year or so -- less participation in class, less effort on homework (perhaps enabled by AI), less curiosity... less interest in mechanical engineering! Perhaps this cohort was already going to buck that trend, but I am putting a framework in place that is help, regardless. As much as possible, you will be less of a “spectator” in your own education and will spend more time “doing”.\n\nA second motivation is this: I understand that engineering students are busy (don’t forget I was once a student too!) and I would like to be as productive as we can in our time together. Traditionally this course required a larger time commitment than . AI use/misuse has made that less true, but\n\nMy goal is to place you in a positive environment and to give you the tools to figure it out.\n\nParticularly with the emergence of AI, it is\n\nA third motivation: I think this is going to be highly effective, both in terms of learning the material and in terms of developing ancillary skills like discussion\n\n. In past versions of this class, I spent the first week coding in class, talking about how to write functions . Students followed\nPerhaps the best possible outcome for this class is for everyone to be problem solvers by the end of the semester.\n\nactive and collaborative\n\ngoing through the motions/spinning their wheels/being a spectator.","type":"content","url":"/flipped-classroom#motivation","position":3},{"hierarchy":{"lvl1":"The Flipped Classroom","lvl2":"Organization"},"type":"lvl2","url":"/flipped-classroom#organization","position":4},{"hierarchy":{"lvl1":"The Flipped Classroom","lvl2":"Organization"},"content":"Here’s how it will look:\n\nThe “lecture content” is 1-3 videos watched before class (so, by Tuesday and Thursday morning). I have gone through great efforts to streamline these videos such that they rarely will exceed 20 minutes, and often will be less than 10. Probably totalling an hour per week.\n\nWe will spend the first few minutes of each class with a very brief summary and questions (in case a good night’s rest didn’t cause the answers to materialize). The summary will not be a complete rehashing of the videos, and instead will be a reminder of the important equations such that we are all on the same page for the class that day.\n\nYou will be given a problem to be completed collaboratively, submitted in groups of three. An example would be to carry out an algorithm by hand through two iterations. The purpose of this is to help you understand the logic of the algorithm by going through it yourself. Then, more-or-less, you will just need to translate that process into language a computer can understand. Were you mimicking a for or while loop?\n\nThe remainder of class will be devoted to getting started on your code in groups -- spiritually, this is office hour time. You may collaborate with colleagues, but everyone writes their own code. You may ask me or the TAs questions. If you are not on-task, you will be asked to leave.\n\nThe same content, delivered in a traditional format, might have taken a whole class period to cover (that is, 2.5 hours per week). This is both a benefit and a drawback: much of each 75-minute class period is devoted to getting the class to quiet down, fighting HDMI cables, making and correcting little mistakes, saying umm... a lot of wasted time that we will mostly avoid. However, a lot of that time is spent on questions from you, which is definitely not a waste of time, and obviously you cannot ask those questions. That is an admitted drawback, but also it could be an opportunity to think on your own (be “active”).\n\nSo the trade I am offering you (and I guess you are being forced to accept) is 30 minutes of “lecture” time at home for 30 minutes of homework time in “lecture”, twice a week. It is a good trade though: that time in class will be very productive because you are collaborating on the problems. I hypothesize that you will need to devote fewer hours to this course than you would if it was in a traditional format. ### Benefits\n\nThe net effect, I hope, is that you will have a deeper understanding of the content (because you talk about it from many angles with your colleagues) while actually requiring less time overall (when considering class+homework time). If we embrace it, the classroom is going to be full of collaboration and discussion. \n\n### Pitfalls\n\nIf you choose, you may look around on the internet to find extreme opinions on the flipped classroom. I'll go ahead and list the common criticisms here for other classes (I am going to try to avoid all of these):\n- It just ends up being more homework. (We will start homework in class.)\n- \n\n\n\n\n\nStudents who just plug in to AI are going to get nothing from this format, and peer-advice like \"just plug it into AI\" is not allowed (except, maybe, for debugging, but even that is discouraged). \n\nAttendance is basically required. Show up to class, get the easy stuff right.\n\nYou will have to watch videos before each class, and so by definition you have homework for this class at least two nights a week.\n\n\n\n\n\n\n ","type":"content","url":"/flipped-classroom#organization","position":5},{"hierarchy":{"lvl1":"“Professional” Emails"},"type":"lvl1","url":"/pro-emails","position":0},{"hierarchy":{"lvl1":"“Professional” Emails"},"content":"Author: Jeremy Koch","type":"content","url":"/pro-emails","position":1},{"hierarchy":{"lvl1":"“Professional” Emails","lvl2":"Motivation"},"type":"lvl2","url":"/pro-emails#motivation","position":2},{"hierarchy":{"lvl1":"“Professional” Emails","lvl2":"Motivation"},"content":"Other instructors in the department are trying to prepare you for the job market, and they have probably taught you how to write “professional emails”. When applying to internships, jobs, etc., it is probably best to err on the side of caution and be aggressively polite. So, OK, start emails to a future employer with “Hope this email finds you well. I am very interested in working for your company, as I see it doing amazing things... blah blah blah”... all that nice stuff.\n\nHowever, I value efficient emails. I don’t want to hunt through three paragraphs to find a question, I want one sentence!  The basic truth I think we all have realized, and that we are going to practice in this class: it is mentally draining to read long emails and craft responses to them, so let’s be efficient! :::{aside}\nSo, maybe I am teaching you how to write emails once you have the job... and are communicating with the same 8 people all the time. This class is like that.\n::: ","type":"content","url":"/pro-emails#motivation","position":3},{"hierarchy":{"lvl1":"“Professional” Emails","lvl2":"A good email"},"type":"lvl2","url":"/pro-emails#a-good-email","position":4},{"hierarchy":{"lvl1":"“Professional” Emails","lvl2":"A good email"},"content":"","type":"content","url":"/pro-emails#a-good-email","position":5},{"hierarchy":{"lvl1":"“Professional” Emails","lvl3":"Key #1: A good subject line","lvl2":"A good email"},"type":"lvl3","url":"/pro-emails#key-1-a-good-subject-line","position":6},{"hierarchy":{"lvl1":"“Professional” Emails","lvl3":"Key #1: A good subject line","lvl2":"A good email"},"content":"Firstly, you should establish the subject. I am asking that students in this course begin their emails with [MCEN 3030] -- yes, with square brackets, yes, with a space between “MCEN” and “3030”. I will filter all emails that include “MCEN 3030” in the subject line to a folder in my inbox. I will pay special attention to this folder, and further, I will be able to find your message more easily in the future if it is in this folder.\n\nIn your future job, the subject might be “EPG” for engine performance group, “PF merger” if your company is buying another company called PF, etc.\n\nSecondly, you should include specific details about the email contents, and the more specific the better (without getting ridiculous). “[MCEN 3030] question” is not a very good subject line -- is it a quick question like “can I use this command in my code” or is it “I got a last-second call to participate in the olympics and need to know whether I should withdraw from this course or if we can work out a way to complete the final from Italy”. The former I can answer in less than 30 seconds, the latter is going to take me a while. You should have a detailed subject line regardless, but to give you more of an incentive: I will be more inclined to open your email if I suspect I can answer the question quickly. Otherwise, it waits for when I am in “email mode”.\n\n“[MCEN 3030] question on bisection inputs” is pretty good. “[MCEN 3030] scikit-learn or pytorch” is good, but I can tell it is going to require a bit more thought (and I appreciate that you made that clear with your subject line). “[MCEN 3030] exam 1 accommodation room” is good. You get the picture.","type":"content","url":"/pro-emails#key-1-a-good-subject-line","position":7},{"hierarchy":{"lvl1":"“Professional” Emails","lvl3":"Key #2: Focused email content","lvl2":"A good email"},"type":"lvl3","url":"/pro-emails#key-2-focused-email-content","position":8},{"hierarchy":{"lvl1":"“Professional” Emails","lvl3":"Key #2: Focused email content","lvl2":"A good email"},"content":"I don’t know who decided that all emails have to begin with “I hope this email finds you well”, but I hate it. In this class, we don’t need that.\n\nMaybe I am a curmudgeon, but if you want the email to actually “find me well”, don’t start it with “I hope this email finds you well”! It found me annoyed!\n\nHere is a GREAT email:\n\nSubject: [MCEN 3030] use built-in flip(x)?\n\nHey Professor,\n\nCan we use MATLAB’s flip(x) in our code?\n\nThanks,\nStudent\n\nHere might be my response:\n\nyep\n\n... hopefully you appreciate that I was able to respond quicker than I might have with a fluffier email. If you want to be equally brief, go ahead. Other professors might get annoyed by the brevity, not me. Just do a good subject line and I will interpret that as you being polite!\n\nHowever, don’t be so brief that you leave out key details. I am not going to do much debugging for you this semester, but in semesters past I have gotten emails like\n\nI tried to use if/elif, but it keeps giving me an error.\n\nEmails like this are part of the reason I am not debugging for students anymore. I was “bailing out” too many students who weren’t even reading and processing the error messages. Deciphering error messages -- develop this skill!\n\nNo details about the error message, the email just said “an error”. So, now I have to send an email asking what the specific error message was, which requires the student to reply, then I have to reply to that. A whole ordeal! Include relevant information! But, also, don’t just dump information on me and make me sort through it. Focused email content!","type":"content","url":"/pro-emails#key-2-focused-email-content","position":9},{"hierarchy":{"lvl1":"“Professional” Emails","lvl3":"Key #3: Don’t ask for special treatment","lvl2":"A good email"},"type":"lvl3","url":"/pro-emails#key-3-dont-ask-for-special-treatment","position":10},{"hierarchy":{"lvl1":"“Professional” Emails","lvl3":"Key #3: Don’t ask for special treatment","lvl2":"A good email"},"content":"I receive countless emails every semester that boil down to students asking for special treatment that violates course policy. Leniency because they:\n\nare taking 19 credit hours.\n\nhad to work.\n\nhad a project due in another class.\n\n“forgot” to turn in an assignment, or “thought they had already submitted it”.\n\n“got an error”.\n\nfell asleep.\n\nhad internet problems at 11:48PM.\n\nTip\n\nIf you are going to “play chicken” with a deadline, you have to accept that you might lose.\n\nFurther, in the Fall 2025 semester I received more “grade-grubbing” emails than ever before, wherein students ask, e.g., for an 89.3% to be rounded to an A-. This is technically academic misconduct!\n\nI am always wary of giving special treatment to the outspoken student, while the introverted student accepts the course policies and stays up until 4AM finishing the homework. Why does the outspoken student deserve the higher grade? They don’t.\n\nThe answer to all of these requests is no. We, unfortunately, give grades in this school, and the course policies are the rules of the game that everyone abides by. I am not going to be the judge of who has a good excuse, and it is not a course policy if I waive it for anyone who asks. Build some more robustness in your schedule where you can -- finishing things by the deadline should not, in general, be stressful.\n\nAs it pertains to the present discussion: Asking me to go against course policy immediately makes it a bad email (and it immediately becomes a huge cognitive load for me because I genuinely am sympathetic). This behavior is a type of “unprofessionalism” that I do care about.","type":"content","url":"/pro-emails#key-3-dont-ask-for-special-treatment","position":11},{"hierarchy":{"lvl1":"Responsible use of AI"},"type":"lvl1","url":"/responsible-ai","position":0},{"hierarchy":{"lvl1":"Responsible use of AI"},"content":" **Author:** Jeremy Koch ","type":"content","url":"/responsible-ai","position":1},{"hierarchy":{"lvl1":"Responsible use of AI","lvl2":"Introduction"},"type":"lvl2","url":"/responsible-ai#introduction","position":2},{"hierarchy":{"lvl1":"Responsible use of AI","lvl2":"Introduction"},"content":"In this course, you have the green light to use AI/LLMs on homework (though not on exams or in-class problems, which are pencil and paper). Here, I will give a perspective on AI use and misuse, including recommendations on how it can be properly used by students.\n\nWarning\n\nIf the instructional staff is not policing AI use, it is you, the student, who must judge proper use. Something to think about: understanding an answer is very different from being able to produce an answer. I suspect many students are asking LLMs to produce a solution, then they “study” it, and then think they “understand” the problem. This is never true --\n\nyou learn when you are stuck, not when you are told the path forward.","type":"content","url":"/responsible-ai#introduction","position":3},{"hierarchy":{"lvl1":"Responsible use of AI","lvl2":"AI Misuse"},"type":"lvl2","url":"/responsible-ai#ai-misuse","position":4},{"hierarchy":{"lvl1":"Responsible use of AI","lvl2":"AI Misuse"},"content":"We instructors worry that students are not developing as engineers because they are allowing the hard work to be done by LLMs. A particularly audacious behavior that I have observed several times: students taking screenshots of problems, pasting into ChatGPT, and then copying the results. These students possibly did not even read the problem!\n\nTip\n\nI have the following (controversial) advice: If these students care so little about the content of mechanical engineering that they are copying answers straight from the LLMs, maybe they would be happier in a different major? They are certainly smart enough to be mechanical engineers, but are they interested?\n\nBut milder uses are also sometimes problematic. The point of homework is NOT\n\nfor you to get stuck and then figure it out! A student who i\n\nIf you are interested, you can read about \n\nBloom’s Taxonomy, which is a framework for understanding how students master a topic. Studying LLM solutions may help you with “knowledge” and “comprehension”, the lower levels of the taxonomy. (“Ah that is how to format the inputs”.) It will not help you get better at the “application”, “analysis”, “synthesis”, or “evaluation” levels, and those are the actually interesting parts of engineering that you are hopefully excited to do.","type":"content","url":"/responsible-ai#ai-misuse","position":5},{"hierarchy":{"lvl1":"Responsible use of AI","lvl2":"AI Reasonable Use"},"type":"lvl2","url":"/responsible-ai#ai-reasonable-use","position":6},{"hierarchy":{"lvl1":"Responsible use of AI","lvl2":"AI Reasonable Use"},"content":"It is my assessment that, overall, LLMs are plagiarism machines. It’s just that they go word-by-word, statistically, and so it is difficult to point to a single source from which their text was plagiarized. However, when it comes to coding, I have a comforting hypothesis that the LLMs are looking at code documentation (e.g. for \n\nnumpy piecewise) and logicking together the inputs and outputs to achieve a goal. I feel a bit better about that, at least from an ethical standpoint.\n\nThis does not mean that LLMs are there to help you learn: if you want to learn, you must be thoughtful about how you interact with them. I cannot make you be thoughtful. In particular: you must resist the urge to jump to the answer. So here are my recommendations on how to responsibly use AI, if your goal is to actually learn:\n\nDo not go to AI at the beginning. Do not go to AI immediately when you get stuck. Getting stuck and thinking about how to get unstuck is very much an authentic engineering experience and is probably the best way to learn. Reread the problem, think about what information is given, what information is missing that is needed, what assumptions could be made etc. A secret: I care more about the first 5 minutes of you working on the homework problem, when you are confused but figuring it out, than the remaining 55 minutes of you grinding through calculus and algebra. The unfortunate thing is that I can’t actually assess that first five minutes, but I can for sure assess whether you report 56.1 m/s.\n\nIf, after a while of being stuck, you have not made much progress, then talk to an AI. But write it in your own words, and try to be specific about the issue. “I am trying to write a root-solving algorithm using Newton-Raphson Method. I am stuck trying to figure out when to end the iterations. I suspect I should use a while statement but am confused on how to implement the logic.” Honestly, I don’t think the AI will need all that detail, but this is not about what the AI needs, it is about what you need! You need to get practice with using engineering language to define problems!\n\nIf you encounter a cryptic error message, again: try to decipher it on your own, and if you can’t figure it out, ask and be specific. Programming languages/environments are usually decent at explaining where the error occurs, giving a line number and the error type (ValueError, KeyError, etc.). “I get the following error: <whatever the error is>. It seems to be related to my function inputs but I am not sure what the message means.” That is not unreasonable, and again, you put some thought into it instead of just asking it to bail you out.\n\nDebugging via AI is a valid use, though I believe developing an eye for debugging is a very valuable skill. Try for a minute to debug on your own, but I get it: AI might save us from spending 90 minutes hunting for some tiny thing.\n\nTip\n\nIf you would be ashamed to show your instructor your prompts, you are probably misusing AI.\n\nWarning\n\nThe inputs to LLMs become part of its training data and thus that information essentially becomes public. You may be in a situation where your organization has an agreement with a particular LLM company to not use the data for training, but I would in general be very careful about what you share. Indeed, in your job, you may be prohibited from sharing proprietary information like diagrams, performance metrics, or computer code with LLMs. You need to practice talking about the big ideas and then implementing the specifics locally, without giving away company secrets to LLMs!\n\nCU seems to have an agreement with Google Gemini where our chats do not go to training their models. (I am not sure if students have the same access as faculty?)","type":"content","url":"/responsible-ai#ai-reasonable-use","position":7},{"hierarchy":{"lvl1":"Necessary Coding Elements"},"type":"lvl1","url":"/coding-elements","position":0},{"hierarchy":{"lvl1":"Necessary Coding Elements"},"content":"Author: Jeremy Koch1,2 \\\n\nThis course is less about using built-in functions like fsolve and more about understanding the algorithms. Truthfully, nearly all of the necessary coding elements to write all the functions in this course appear on this page -- indexing, if, for, while. You’ll need to do some space preallocation, maybe with something built-in called zeros; might need to use the modulus function to determine if a number is odd or even... not much else.\n\nCaution\n\nI think staring at this list in hopes of memorizing it is a terrible use of your time. Instead, treat this as a reference list early in the semester. It is perfectly reasonable to recognize that you will need a list of 500 numbers between 100 and 200, and you open this page to figure it out. Before long many of these will will become second nature to you.\n\nBig picture: the best way to learn is to do it. No amount of reading my code is going to make you a skilled programmer.","type":"content","url":"/coding-elements","position":1},{"hierarchy":{"lvl1":"Necessary Coding Elements","lvl2":"Creating vectors/matrices/arrays"},"type":"lvl2","url":"/coding-elements#creating-vectors-matrices-arrays","position":2},{"hierarchy":{"lvl1":"Necessary Coding Elements","lvl2":"Creating vectors/matrices/arrays"},"content":"x1=0:0.1:2;                 % start:step:stop\nx2=linspace(0,10,500);      % 500 points between 0 and 10\nx3=logspace(4,7,500);       % 500 log-spaced points between 10^4 and 10^7\nA=[[1,2,3];[4,5,6]];        % a matrix is an array of arrays, rows separated by ;\n\ny=zeros(1,length(x2));      % a row vector full of zeros with the same length as x2\nz=ones(1,length(x2));       % same, but full of ones\nA=zeros(4,4);               % a 4x4 matrix of zeros\nB=eye(4);                   % diagonal is full of ones, rest zero\nD=diag([5,3,1]);            % diagonal is 5,3,1, rest zero\nD2=diag([5,3,1],1);         % the first diagonal above the main is [5,3,1]... so this is a 4x4 matrix\n\nr=rand(1,5);                % a row vector with 5 random numbers, uniformly spaced between 0 and 1\nR=rand(4,4);                % same, but a 4x4 matrix :::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n:::\n:::{tab-item} C++\n```cpp\nf=lambda x: x**2\n```\n::: ","type":"content","url":"/coding-elements#creating-vectors-matrices-arrays","position":3},{"hierarchy":{"lvl1":"Necessary Coding Elements","lvl2":"Indexing: Accessing and Modifying Elements"},"type":"lvl2","url":"/coding-elements#indexing-accessing-and-modifying-elements","position":4},{"hierarchy":{"lvl1":"Necessary Coding Elements","lvl2":"Indexing: Accessing and Modifying Elements"},"content":"The focus on many debates: should arrays be indexed starting with zero or one? Python indexes starting with 0, MATLAB and Julia index starting with 1.\n\n\nx(i)                        % accesses the ith element of x\nx(3:)                       % elements 3 to the end\nx(:5)                       % the first through fifth elements\nx(2:4)                      % the second, third, and fourth elements\n\nA(4,1)                      % fourth element in column 1\nA(:,5)                      % the fifth column... a vector\nA(4,:)                      % the fourth row\n\n% for all of the above, you can reassign values with =, e.g.\nx(3)=5;                     % changes the third element to 5\nA(:,5)=0;                   % changes the entire fifth column to 0 :::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n::: ","type":"content","url":"/coding-elements#indexing-accessing-and-modifying-elements","position":5},{"hierarchy":{"lvl1":"Necessary Coding Elements","lvl2":"Doing math with them"},"type":"lvl2","url":"/coding-elements#doing-math-with-them","position":6},{"hierarchy":{"lvl1":"Necessary Coding Elements","lvl2":"Doing math with them"},"content":"","type":"content","url":"/coding-elements#doing-math-with-them","position":7},{"hierarchy":{"lvl1":"Necessary Coding Elements","lvl2":"Conditional Statements"},"type":"lvl2","url":"/coding-elements#conditional-statements","position":8},{"hierarchy":{"lvl1":"Necessary Coding Elements","lvl2":"Conditional Statements"},"content":"","type":"content","url":"/coding-elements#conditional-statements","position":9},{"hierarchy":{"lvl1":"Necessary Coding Elements","lvl2":"Loops"},"type":"lvl2","url":"/coding-elements#loops","position":10},{"hierarchy":{"lvl1":"Necessary Coding Elements","lvl2":"Loops"},"content":"","type":"content","url":"/coding-elements#loops","position":11},{"hierarchy":{"lvl1":"Necessary Coding Elements","lvl2":"Miscellaneous"},"type":"lvl2","url":"/coding-elements#miscellaneous","position":12},{"hierarchy":{"lvl1":"Necessary Coding Elements","lvl2":"Miscellaneous"},"content":"","type":"content","url":"/coding-elements#miscellaneous","position":13},{"hierarchy":{"lvl1":"Necessary Coding Elements","lvl2":"Some common motifs"},"type":"lvl2","url":"/coding-elements#some-common-motifs","position":14},{"hierarchy":{"lvl1":"Necessary Coding Elements","lvl2":"Some common motifs"},"content":"Don’t “hard-code” in numbers if you can avoid it! It will make your code more flexible, readable, and easier to debug. For example:\n\nx=1:100;\ny=1:100;\nfor i=1:100          \n    % are we iterating through x or y?\n    % If we have to change whichever of them to 1:500, we'd have to change our \"for\" line above\nend\n\n% this is better\nfor i=1:length(y)\n    % now we know it is iterating through y\n    % and if we change to y=1:500, it automatically is ready to go!\nend :::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n::: \n\nIf you need something to happen if a number is even:\n\nif mod(x,2)==0  % even!\n    % do something\nelse            % odd!\n    % do something else\nend :::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n::: \n\nTo calculation a summation\n\nN=15;       % how many terms to include\nS=0;        % initialize the sum at zero\nfor n=1:N\n    S=S+sin(n);\nend :::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n:::  :::{aside}\nhttps://en.wikipedia.org/wiki/Magnetic-core_memory\n::: ","type":"content","url":"/coding-elements#some-common-motifs","position":15},{"hierarchy":{"lvl1":"Necessary Coding Elements","lvl2":"Functions"},"type":"lvl2","url":"/coding-elements#functions","position":16},{"hierarchy":{"lvl1":"Necessary Coding Elements","lvl2":"Functions"},"content":"MATLAB has a lot of restrictive rules about functions. Function files must be named the same as the top function in the file. Local functions must appear at the bottom of the main function file or script, and are not “known” outside the file.function [out1,out2]=my_fxn(in1,in2)\n\n\n\n“Anonymous” functions (I don’t know why they are called that), are written likef=@(x) x^2\n\nf=lambda x: x**2\n\nf= x -> x^2","type":"content","url":"/coding-elements#functions","position":17},{"hierarchy":{"lvl1":"Explore your language in some basic tasks"},"type":"lvl1","url":"/explore-some-tasks","position":0},{"hierarchy":{"lvl1":"Explore your language in some basic tasks"},"content":"Author: Jeremy Koch","type":"content","url":"/explore-some-tasks","position":1},{"hierarchy":{"lvl1":"Explore your language in some basic tasks","lvl2":"Figure out how to write a function"},"type":"lvl2","url":"/explore-some-tasks#figure-out-how-to-write-a-function","position":2},{"hierarchy":{"lvl1":"Explore your language in some basic tasks","lvl2":"Figure out how to write a function"},"content":"","type":"content","url":"/explore-some-tasks#figure-out-how-to-write-a-function","position":3},{"hierarchy":{"lvl1":"Explore your language in some basic tasks","lvl2":"Figure out how to plot"},"type":"lvl2","url":"/explore-some-tasks#figure-out-how-to-plot","position":4},{"hierarchy":{"lvl1":"Explore your language in some basic tasks","lvl2":"Figure out how to plot"},"content":"... including setting axis labels.","type":"content","url":"/explore-some-tasks#figure-out-how-to-plot","position":5},{"hierarchy":{"lvl1":"Explore your language in some basic tasks","lvl2":"Figure out"},"type":"lvl2","url":"/explore-some-tasks#figure-out","position":6},{"hierarchy":{"lvl1":"Explore your language in some basic tasks","lvl2":"Figure out"},"content":"","type":"content","url":"/explore-some-tasks#figure-out","position":7},{"hierarchy":{"lvl1":"Explore your language in some basic tasks","lvl2":"Some examples"},"type":"lvl2","url":"/explore-some-tasks#some-examples","position":8},{"hierarchy":{"lvl1":"Explore your language in some basic tasks","lvl2":"Some examples"},"content":"","type":"content","url":"/explore-some-tasks#some-examples","position":9},{"hierarchy":{"lvl1":"Explore your language in some basic tasks","lvl2":"Taylor Series Convergence?"},"type":"lvl2","url":"/explore-some-tasks#taylor-series-convergence","position":10},{"hierarchy":{"lvl1":"Explore your language in some basic tasks","lvl2":"Taylor Series Convergence?"},"content":"We will soon use the Taylor Series\\hat{f}(x) = f(x_0) + \\sum\\limits_{n=1}^\\infty \\frac{1}{n!}(x-x_0)^nf^{(n)}(x_0)\n\nas part of a derivation. But: are we so sure the Taylor Series converges, even when (x-x_0)\\gg 1?\n\\begin{enumerate}\n\\item First, write a little function that computes the factorial of a number. Hint: Check the example code included in the \n\nlanguages page, and instead of adding, multiply.\n\\item Make a plot of n vs. c^n/n!, with c being a decent-sized constant (say 100). Confirm that the plot asymptotes to zero. It may be worthwhile to do a log-scaled plot.\n\\end{enumerate}","type":"content","url":"/explore-some-tasks#taylor-series-convergence","position":11},{"hierarchy":{"lvl1":"Explore your language in some basic tasks","lvl2":"Infinite Series"},"type":"lvl2","url":"/explore-some-tasks#infinite-series","position":12},{"hierarchy":{"lvl1":"Explore your language in some basic tasks","lvl2":"Infinite Series"},"content":"The summation\\sum\\limits_{k=1}^\\infty","type":"content","url":"/explore-some-tasks#infinite-series","position":13},{"hierarchy":{"lvl1":"Explore your setup possibilities"},"type":"lvl1","url":"/explore-your-setup","position":0},{"hierarchy":{"lvl1":"Explore your setup possibilities"},"content":"Author: Jeremy Koch","type":"content","url":"/explore-your-setup","position":1},{"hierarchy":{"lvl1":"Explore your setup possibilities","lvl2":""},"type":"lvl2","url":"/explore-your-setup","position":2},{"hierarchy":{"lvl1":"Explore your setup possibilities","lvl2":""},"content":"","type":"content","url":"/explore-your-setup","position":3},{"hierarchy":{"lvl1":"Explore your setup possibilities","lvl2":"Syntax highlighting"},"type":"lvl2","url":"/explore-your-setup#syntax-highlighting","position":4},{"hierarchy":{"lvl1":"Explore your setup possibilities","lvl2":"Syntax highlighting"},"content":"","type":"content","url":"/explore-your-setup#syntax-highlighting","position":5},{"hierarchy":{"lvl1":"Explore your setup possibilities","lvl2":"Some examples"},"type":"lvl2","url":"/explore-your-setup#some-examples","position":6},{"hierarchy":{"lvl1":"Explore your setup possibilities","lvl2":"Some examples"},"content":"","type":"content","url":"/explore-your-setup#some-examples","position":7},{"hierarchy":{"lvl1":"Defining Functions (language specifics)"},"type":"lvl1","url":"/functions","position":0},{"hierarchy":{"lvl1":"Defining Functions (language specifics)"},"content":" **Author:** Jeremy Koch<sup>1,2</sup> \\ ","type":"content","url":"/functions","position":1},{"hierarchy":{"lvl1":"Defining Functions (language specifics)","lvl2":"Some vocabulary"},"type":"lvl2","url":"/functions#some-vocabulary","position":2},{"hierarchy":{"lvl1":"Defining Functions (language specifics)","lvl2":"Some vocabulary"},"content":"Script\n\nWe will take this to mean a coding file with simple instructions that don’t require much overhead, e.g.: make a list of numbers between 0 and 50, use them in a function, and print the results. This takes three lines of code in a *.m, *.py, or *.jl file, no need for any formal declarations, just go through the steps in that script, in order.\n\nFor our purposes, MATLAB, Python, and Julia are all “scripting languages”, though that title is controversial for Julia because it is technically compiled.\n\nFunction\n\nThese turn inputs into outputs according to a set of rules. Functions require a formal declaration, the structure of which is basically the same in all languages: somewhere you declare the function name, input variables, and how to return the outputs. Specifics of each language are discussed below.\n\n(Input) Arguments\n\nThe\n\nCall\n\nWe “call” functions from other functions or scripts, providing the necessary input arguments and allocating space for the outputs. In no language do the variable names in the call need to match the variable names in the function definition. After all, we sometimes will call a function twice, getting two (sets of) outputs.\n\nAnonymous Function\n\nMATLAB, Python, and Julia all have a way of writing small functions that are not stored under a traditional function name (hence the moniker “anonymous”). They are still stored under a variable name... I am sure there are some subtleties I am missing. When part of a project’s foundational architecture, this type of function definition is discouraged (one reason: it makes tracing errors difficult because the functions are not named in the error messages). However, within scripting languages, it is often a really nice tool to create an equation function for use in our algorithms like f(x) = \\ln{\\sin(x)}. As an example: f=@(x) log(sin(x)) (in MATLAB).","type":"content","url":"/functions#some-vocabulary","position":3},{"hierarchy":{"lvl1":"Defining Functions (language specifics)","lvl3":"A note about the exam format","lvl2":"Some vocabulary"},"type":"lvl3","url":"/functions#a-note-about-the-exam-format","position":4},{"hierarchy":{"lvl1":"Defining Functions (language specifics)","lvl3":"A note about the exam format","lvl2":"Some vocabulary"},"content":"The questions will be akin to writing scripts: think about what function(s) might be relevant, set up the necessary inputs, handle the outputs, post-process, etc.","type":"content","url":"/functions#a-note-about-the-exam-format","position":5},{"hierarchy":{"lvl1":"Defining Functions (language specifics)","lvl2":"Functions"},"type":"lvl2","url":"/functions#functions","position":6},{"hierarchy":{"lvl1":"Defining Functions (language specifics)","lvl2":"Functions"},"content":"Functions are slightly different than scripts -- you can “call” a function from a script or another function, even another file (provided it is in an appropriate location). Each language has slightly different rules:\n\nRules for MATLAB functions:\n\nThe output variables must be named in the function declaration (out1 and out2 in the function defined below).\n\nIn order to retrieve outputs 2, 3, ... when calling a function, you must allocate space for them in the call. By default, MATLAB only returns the first output. (However, if you want to be a bit sleek, you can use ~ as one or more of the variable names, and MATLAB won’t bother storing those numbers anywhere.)\n\nIn order for a function to be available outside the *.m in which it is written, the *.m file name must match the function name and the first line of the *.m file must be the function definition.\n\nFunctions can be called from other functions/scripts/the command window when they are in the current working directory, or if the “path” has been added.\n\n“Local” functions are “known” only within . These are sometimes useful to handle some work that would make the main function messy. The definition must occur below the “main” function.\n\nA consequence of the above: there is only one “main” function per *.m file. This is one of the most annoying things about MATLAB.\n\nA function file, with a local function below it:function [out1,out2]=my_fxn(in1,in2)\n    out1=(in1+in2)/2;\n    out2=sqrt(in1*in2);\nend\n\n... and a script that would call this function.function [out1,out2]=my_fxn(in1,in2)\n    out1=(in1+in2)/2;\n    out2=sqrt(in1*in2);\nend\n\nNote that:\n\nThe function file must be named my_fxn.m and must be in the same directory as the script. The script could be called anything.\n\nCalling local_fxn(...) from the script would cause an error.\n\nRules for Python functions:\n\nFunctions must be defined earlier than they are used -- e.g., the function definition cannot occur on lines 13-17 and be called on line 5.\n\nYou can include as many\n\nIf your return includes more than one variable, you must have more than one variable defined in your function call line. It will complain about expecting a different-sized output.\n\n\n\nHere is a file with a couple functions in it:import numpy as np\nk=2\nm=np.sin(2)\nprint(m)\n\nRules for Julia functions:\n\nDefinition looks like\n\nInstead of a return statement, one can use the “implicit output”: the last variable given a value in the function. I am suspicous of this and recommend a return out1,out2 before the end. It is kind of clumsy-looking to have both though.","type":"content","url":"/functions#functions","position":7},{"hierarchy":{"lvl1":"Defining Functions (language specifics)","lvl2":"What can be passed to functions?"},"type":"lvl2","url":"/functions#what-can-be-passed-to-functions","position":8},{"hierarchy":{"lvl1":"Defining Functions (language specifics)","lvl2":"What can be passed to functions?"},"content":"","type":"content","url":"/functions#what-can-be-passed-to-functions","position":9},{"hierarchy":{"lvl1":"Defining Functions (language specifics)","lvl2":"Optional Arguments"},"type":"lvl2","url":"/functions#optional-arguments","position":10},{"hierarchy":{"lvl1":"Defining Functions (language specifics)","lvl2":"Optional Arguments"},"content":"All the languages have an option to include optional arguments. These do not have to be included in the function call, and if not, they will default to the value included in the function definition.\n\nFor MCEN 3030, a common use is to define a standard error or a maximum number of iterations. Here is how that would look:\n\nfunction x_R=Newton_Raphson1(f,x_0,err_accept=10^-3,max_iter=1000)\n    ...\n    % NR method where the function terminates when the error reaches 10^-3 or 1000 iterations have occurred.\n    ...\nend\n\ndef Newton_Raphson1(f,x_0,err_accept=10^-3,max_iter=1000)\n    ...\n    # NR method where the function terminates when the error reaches 10^-3 or 1000 iterations have occurred.\n    ...\n    return x_R\n\n","type":"content","url":"/functions#optional-arguments","position":11},{"hierarchy":{"lvl1":"GitHub"},"type":"lvl1","url":"/github","position":0},{"hierarchy":{"lvl1":"GitHub"},"content":"Author: Jeremy Koch1,2 \\","type":"content","url":"/github","position":1},{"hierarchy":{"lvl1":"GitHub","lvl2":"Binary"},"type":"lvl2","url":"/github#binary","position":2},{"hierarchy":{"lvl1":"GitHub","lvl2":"Binary"},"content":"“Computers are just a bunch of 1’s and 0’s” is absolutely true --","type":"content","url":"/github#binary","position":3},{"hierarchy":{"lvl1":"GitHub","lvl2":"How the instructional team will use GitHub"},"type":"lvl2","url":"/github#how-the-instructional-team-will-use-github","position":4},{"hierarchy":{"lvl1":"GitHub","lvl2":"How the instructional team will use GitHub"},"content":"We will additionally be tracking the commit history for every student in the course. While it is not a perfect indicator, commit history is an interesting proxy for student effort and learning:\n\nOne commit early in the week suggests the student looked at the assignment but hardly got started.\n\nFive commits over the course of the week suggests the student is engaged with the assignment and is likely learning from it.\n\nOne commit Friday at 11:51PM suggests genius. Just kidding, these students probably misused AI, or at least has bad commit habits. :::{aside}\nhttps://en.wikipedia.org/wiki/Magnetic-core_memory\n:::  ::::{tab-set}\n:::{tab-item} MATLAB\n```MATLAB\nf=@(x) x^2\n```\n:::\n:::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n:::\n\n:::: ","type":"content","url":"/github#how-the-instructional-team-will-use-github","position":5},{"hierarchy":{"lvl1":"Getting going in your language"},"type":"lvl1","url":"/installing","position":0},{"hierarchy":{"lvl1":"Getting going in your language"},"content":"Author: Jeremy Koch1,2 \\\n\nA few recommendations, if you want them. MATLAB has some special steps because we have a license through the school, though overall the installation process is probably the easiest.\n\nThe other languages are open source, meaning you can follow any online tutorial to get them installed. Python technically can be installed with a graphical user interface (GUI), but I have grown to hate that environment -- I recommend miniconda, as described below. You will need to do a bit of work from the command line. Julia takes some command line work. C++ probably does, I’ll be honest I have never installed it. If you flat-out do not want to do command line stuff, just go with MATLAB, but it makes me feel powerful to do command line stuff!","type":"content","url":"/installing","position":1},{"hierarchy":{"lvl1":"Getting going in your language","lvl2":"MATLAB"},"type":"lvl2","url":"/installing#matlab","position":2},{"hierarchy":{"lvl1":"Getting going in your language","lvl2":"MATLAB"},"content":"MATLAB is the easiest to get going. As a CU student, you have free access if you create an account using your CU email address. Instructions are \n\nhere -- use the ones for students, under “How to get it”.\n\nOnce you have a MathWorks account and have it associated with the school’s license, you can choose to download a desktop version of MATLAB, or to access the cloud version of the software. (See the note below about toolboxes before installing!) Students in previous semesters have used both options, so you can decide what works best for you. However, if you use the online version, you must download the code and upload it to your GitHub repository. I like the immediate access of having MATLAB installed on my machine, and I think it runs a bit faster, but you can access your code from any computer if you are using the online version.\n\nThe MathWorks site has many tutorials, maybe most notably the “MATLAB OnRamp”. \n\nYou can find it here... it is an “Online Training”.","type":"content","url":"/installing#matlab","position":3},{"hierarchy":{"lvl1":"Getting going in your language","lvl3":"Toolboxes","lvl2":"MATLAB"},"type":"lvl3","url":"/installing#toolboxes","position":4},{"hierarchy":{"lvl1":"Getting going in your language","lvl3":"Toolboxes","lvl2":"MATLAB"},"content":"Basic MATLAB is going to be enough for the homework in this class, and you can always add toolboxes later. Some recommended ones:\n\nSimulink is used MCEN 4043: System Dynamics\n\nParticularly if you are gearing up for MCEN 3047: Data Analysis and MCEN 4043: System Dynamics, I recommend installing:\n\nSimulink\n\nThe image processing toolbox (if you have any interest in that stuff)\n\nThe machine learning toolbox\nBut you can always add packages later, as needed. Packages are immediately available in the online version if you ever need to just try something really quick.","type":"content","url":"/installing#toolboxes","position":5},{"hierarchy":{"lvl1":"Getting going in your language","lvl2":"Python"},"type":"lvl2","url":"/installing#python","position":6},{"hierarchy":{"lvl1":"Getting going in your language","lvl2":"Python"},"content":"There are multiple avenues here, and if you are confident enough to find you own way (e.g. with pip), I believe in you.\n\nMy recommendation is to \n\ninstall miniconda -- NOT the full Anaconda (which you can find nearby if you really want to, but I’m not linking it). Anaconda is attractive: it has everything you need in one install, but also a lot of unnecessary stuff. I grew to hate the navigator and “downgraded” to miniconda.\n\nMiniconda will require you to install the packages you need, but it is lean because you are not going to install a bunch of useless stuff. Further, it is good code practice to establish separate environments for each of your projects with just the essentials for that project. Not really important for this class, but if you are curious we can talk or you can read about it.\n\nAdditionally, I am not fond of the IDEs (Integrated Development Environment) that come with Anaconda. I much prefer \n\nVS Code, which even supports Jupyter Notebooks these days. You can technically incorporate VS Code into the Conda Navigator but my recommendation is: don’t.","type":"content","url":"/installing#python","position":7},{"hierarchy":{"lvl1":"Getting going in your language","lvl3":"Package management","lvl2":"Python"},"type":"lvl3","url":"/installing#package-management","position":8},{"hierarchy":{"lvl1":"Getting going in your language","lvl3":"Package management","lvl2":"Python"},"content":"Assuming you are using miniconda, \n\nthis page has instructions. Note that miniconda still uses “conda” in the command line.\n\npip is another option, really it’s not that different. If you have reason to go that way, do it, plenty of tutorials around.\n\nTip\n\nIf you do want to create separate environments, e.g., one for your homework repository, one for the machine learning project, you can. From the command line, you would start with something like conda create --name homework and then conda activate homework puts you in that environment, and then conda install numpy would get you numpy in that environment. You need to install packages in each environment -- you might technically have numpy installed two or three times. But this is the way to manage conflicts: TensorFlow, for example, apparently doesn’t play nice with numpy version 2.0 or higher... though I reverted back to that version of numpy and still couldn’t get it to work!","type":"content","url":"/installing#package-management","position":9},{"hierarchy":{"lvl1":"Getting going in your language","lvl2":"Julia"},"type":"lvl2","url":"/installing#julia","position":10},{"hierarchy":{"lvl1":"Getting going in your language","lvl2":"Julia"},"content":"Go \n\nhere, and the \n\nrecommended IDE is again VS Code, and there is again \n\na debugger.\n\nThough Julia is technically a compiled language, working within VS Code makes it not feel compiled, which is nice.","type":"content","url":"/installing#julia","position":11},{"hierarchy":{"lvl1":"Getting going in your language","lvl2":"C++"},"type":"lvl2","url":"/installing#c","position":12},{"hierarchy":{"lvl1":"Getting going in your language","lvl2":"C++"},"content":"You are on your own! You might talk to our TAs, they have experience with C++... I do not. If you took CSCI 1300 you are hopefully good to go.","type":"content","url":"/installing#c","position":13},{"hierarchy":{"lvl1":"Languages"},"type":"lvl1","url":"/languages","position":0},{"hierarchy":{"lvl1":"Languages"},"content":" **Author:** Jeremy Koch \n\nDespite what you may have heard, this is not “a MATLAB course” -- I would describe it as “an applied math course”. Indeed, many of the algorithms we will describe were invented long before computers. In previous iterations of this course we have insisted that students use MATLAB with the largest reason being to streamline the student, grader, and instructor experience.\n\nThere are indeed good reasons to use MATLAB, most notably it is easiest to get set up and it is used in other mechanical engineering courses. If those reasons are compelling to you, use MATLAB. However, some folks might be looking ahead to a career where MATLAB is not the standard and would like to get experience now with a language that aligns with their career goals. Or they already have some experience in a different language and would like to keep using it.\n\nSo what I am getting at?\n\nI am giving you this opportunity to choose the language you use in this course: you may choose MATLAB, Python, or Julia, and will have thousands of lines of coding experience in that language by the end of the semester. (Other languages: let’s talk. But they need to be “scripting” or “scripting-like”.)\n\nFor all three languages, I have provided\n\na page that includes nearly all necessary coding elements that you may reference as you complete your homework.\n\na page that has recommendations about how to get these set up, though, other than MATLAB, you have a lot of flexibility.\n\nand we have an \n\n“AI green light” on homework assignments, which you should not \n\nmisuse, but it will help to enable this “polyglot” approach to the course.\n\nWarning\n\nNo matter what language you choose, you should be prepared to KNOW things like: whether indexing starts with 0 or 1, how to find the length of an array, how to write a for loop, the character used for comments # % ..., etc. On the exams, forgetting that Python indexes from 0 or that MATLAB requires you to end loops will lose you points -- do not ask for leniency if you make these mistakes. I am empowering you to learn and use whatever language you want, so learn it!","type":"content","url":"/languages","position":1},{"hierarchy":{"lvl1":"Languages","lvl2":"TL;DR:"},"type":"lvl2","url":"/languages#tl-dr","position":2},{"hierarchy":{"lvl1":"Languages","lvl2":"TL;DR:"},"content":"Choose MATLAB if you want the easiest installation, or if you just want some direct, explicit, no fuss experience with the language that is (probably going to be) used in MCEN 3047: Data Analysis and MCEN 4043: System Dynamics.\n\nChoose Python if you want to use the widest-used language.\n\nChoose Julia if you are a adventurous and want to try a “real” programming language that was developed for scientists and engineers. Especially if you have experience with the other languages and want to see if this new language is worth the hype. (See “More Reading” below.) - Choose C++ if already have some experience with it and enjoy it. I don't think any language will prohibit you from working with robots in the future, but C++ is probably the one most associated with robotics. \n\nOther: let’s talk. C++ is not really a scripting language but we could maybe make it work. Java, JavaScript, Ruby, Go... not really engineering languages. Machine, Assembly, FORTRAN, no.\n\nFYI you might \n\ncheck out these stats to get an idea of the prevalence of each language. Python is #1 on GitHub, C++ is #5, Julia is #31, MATLAB is #43 (though it has its own site for sharing code elsewhere). Languages 2-4, Java, Go, and JavaScript, are not really appropriate tools for mathematical algorithms.\n\nSee a more detailed list of pros and cons below, and talk to me if you want to talk about your options. I would guess 60% of the class will choose MATLAB, 35% will choose Python, and 5% will choose Julia/other. (Again: talk to me about “other”.) I will let the class know what the distribution is -- I am sure you are curious!\n\nTip\n\nIn the grand scheme of things, these languages are very similar, using index:slicing, for, while, etc. You will be able to understand each other’s code and will be pretty capable of switching between languages in the future, if needed.\n\nWarning\n\nNote that you are responsible for setting up and maintaining your programming environment, which is trivial for MATLAB and a bit more involved for the other languages.\n\nIncluded at the bottom of each of these tabs is an example bit of code that would compute\\sum\\limits_{n=1}^N \\frac{1}{n^k}\n\nto give you a feel for what some basic code looks like. If you are curious, I would encourage you to look around online for other examples of what the code looks like. You can also see the page with some basics.","type":"content","url":"/languages#tl-dr","position":3},{"hierarchy":{"lvl1":"Languages","lvl2":"Pros/Cons"},"type":"lvl2","url":"/languages#pros-cons","position":4},{"hierarchy":{"lvl1":"Languages","lvl2":"Pros/Cons"},"content":"Reasons to choose MATLAB:\n\nFor students it is free.\n\nBasically no package management: you can either download MATLAB and run it on your machine, or use MATLAB online.\n\nMATLAB has an excellent built-in debug mode.\n\nMATLAB has traditionally been used in MCEN 3047: Data Analysis and MCEN 4043: System Dynamics. Maybe you don’t want to be distracted with another language.\n\nIt is a language for scientists and engineers. Matrix math is just: A*x.\n\nIndexing starts with 1.\n\nReasons to NOT choose MATLAB:\n\nWhile it is 100% free for students, it is not free in the real world: a yearly license for an individual costs $1015.\n\nRelated: some companies do use MATLAB and surely are getting a discount from that per-person price tag, but most companies are not going to want to pay thousands of dollars when there are many free options that can do all the same tasks.\n\nMATLAB allows you to be “sloppy” in ways that make serious programmers shake their head. But at the same time, Julia can seem overly rigorous (e.g. with variable scope).\n\nBooting it up takes a minute.\n\nI find it annoying that the default is to print every line and a ; must be added to prevent that.\n\nExample code:k=2;\nN=50;\nS=0;        % initialize the sum at zero\nfor n=1:N\n    S=S+1/n^k;\nend\nprint(S)\n\nReasons to choose Python:\n\nFor everyone it is free (open source).\n\nIndenting/whitespace is used instead of end statements, which makes the code look really clean. (However, see the note below about numpy.)\n\nPython is probably the widest used language for scientific computing, or at least it has the most momentum. It is definitely the widest-used for machinel learning.\n\nReasons to NOT choose Python:\n\nIndexing starts with 0, which might annoy you enough to look elsewhere.\n\nThe install process, including package management, is not overwhelming, but it is extra steps that may have to occur in the command window/terminal.\n\nBase Python was not invented for engineers. NumPy/SciPy/matplotlib have been thoroughly developed, but it just less appealing to have to deal with np.sin(x) instead of just sin(x). (Yes, I know you can from numpy import sin or even from numpy import * but that is rarely done.) Raising to a power is **? OK?\n\nExample code:import numpy as np # this will be necessary in almost every function\n\nk=2\nN=50\nS=0            # initialize the sum at zero\nfor n in 1:N\n    S+=1/n**k\n\nprint(S)\n\nReasons to choose Julia:\n\nFor everyone it is free (open source).\n\nIt is a language developed for scientists and engineers, and the user base is a lot of scientists and engineers.\n\nIt allows the use of unicode characters. Thus, if you want to write an equation that has an α in it, you can use α. (In other languages we’d probably use a or alpha, which is just not as satisfying.)\n\nIndexing starts with 1.\n\nReasons to NOT choose Julia:\n\nJulia is a compiled language. This means the first time you run a new program, it may be slow. My experience is that this is not a big deal.\n\nIt is the least well-developed of the languages in this list, meaning there are fewer tutorials, fewer third-party programs, and fewer users to help.\n\nIt is not clear if Julia will continue to grow or if it will fade away -- you might become an expert in something that no one cares about in 10 years.\n\nWe will likely not have need to use the truly powerful aspects of Julia, e.g. multiple dispatch.\n\nIt seems that Julia sometimes goes out of its way to name things differently than MATLAB/Python. In MATLAB: linspace(0,10,101) makes an array with 101 elements. In Python+NumPy it is np.linspace(0,10,101). In Julia it is LinRange(0,10,101)... OK Julia. This is not a reason not to choose Julia on its own, but if you are talking to MATLAB/Python people it is a little annoyance.\n\nFurther: there are probably deep reasons why it does this, but Julia localizes the scope of some of its variables to within a loop. :::{tab-item} C++\nReasons to choose C++:\n- For everyone it is free (open source).\n- You may have taken CSCI 1300, which uses C++, and want to continue with that.\n- It has arguably been the language of \"serious engineers\" for the past 30 years. Robotics has a strong preference towards C++, and the biggest open-source computational fluid dynamics (CFD) code, [OpenFOAM](https://www.openfoam.com), is/was based in C++. Arduino is basically specialized C++.\n\nReasons to NOT choose C++:\n- C++ is a compiled language. This means the first time you run a new program, it may be slow. It also may still be fast enough to not bother you.\n- I think it is the ugliest and least-readable language of the four in the list.\n- Not that it matters because I am not going to debug your code for you, but I have nearly zero experience with C++. (I do have some experience in C, and I kinda like it, but it has been a while.)\n::: \n\nContact me.","type":"content","url":"/languages#pros-cons","position":5},{"hierarchy":{"lvl1":"Languages","lvl2":"More Reading"},"type":"lvl2","url":"/languages#more-reading","position":6},{"hierarchy":{"lvl1":"Languages","lvl2":"More Reading"},"content":"MATLAB vs. Julia vs. Python\n\nWhy numbering should start at zero (not sure I agree but, here is a reading)\n\nhttps://​forem​.julialang​.org​/vinodv​/julia​-vectors​-and​-matrices​-n2l","type":"content","url":"/languages#more-reading","position":7},{"hierarchy":{"lvl1":"Types of error"},"type":"lvl1","url":"/error","position":0},{"hierarchy":{"lvl1":"Types of error"},"content":"Author: Jeremy Koch1,2 \\","type":"content","url":"/error","position":1},{"hierarchy":{"lvl1":"Types of error","lvl2":"How would you..."},"type":"lvl2","url":"/error#how-would-you","position":2},{"hierarchy":{"lvl1":"Types of error","lvl2":"How would you..."},"content":"Create a vector with 50 elements, equally spaced between 0 and 4?\n\nCreate a vector of random numbers between 2 and 3?\n\nPlot f(x)=x(3-x) with a continuous line?\n\nAdd random noise from a normal distribution to a line f(x)=mx+b? (With a known mean and variance.)\n\n","type":"content","url":"/error#how-would-you","position":3},{"hierarchy":{"lvl1":"Types of error","lvl2":"Some things to think about..."},"type":"lvl2","url":"/error#some-things-to-think-about","position":4},{"hierarchy":{"lvl1":"Types of error","lvl2":"Some things to think about..."},"content":"If we wanted to find the solution to \\exp(x)=1.85 (and you didn’t know where the \\ln button was on your calculator), is the f(x) in our root-finding methods \\exp{x}?\n\nSketch f(x)=\\cos{x}-0.85. If we try to find the first positive root of this equation using Newton-Raphson, would a seed x_0=0 get us there?","type":"content","url":"/error#some-things-to-think-about","position":5},{"hierarchy":{"lvl1":"Representation of Numbers"},"type":"lvl1","url":"/floats","position":0},{"hierarchy":{"lvl1":"Representation of Numbers"},"content":"Author: Jeremy Koch1,2 \\","type":"content","url":"/floats","position":1},{"hierarchy":{"lvl1":"Representation of Numbers","lvl2":"Binary"},"type":"lvl2","url":"/floats#binary","position":2},{"hierarchy":{"lvl1":"Representation of Numbers","lvl2":"Binary"},"content":"“Computers are just a bunch of 1’s and 0’s” is absolutely true -- early storage of information was achieved by\n\nMagnetic-core memory\n\nAll of this is going on “under the hood” -- we don’t need to spend too much time worrying about reading/writing/translating things in binary. The computer just reports numbers to us in base 10.","type":"content","url":"/floats#binary","position":3},{"hierarchy":{"lvl1":"Representation of Numbers","lvl2":"Bigger Numbers"},"type":"lvl2","url":"/floats#bigger-numbers","position":4},{"hierarchy":{"lvl1":"Representation of Numbers","lvl2":"Bigger Numbers"},"content":"","type":"content","url":"/floats#bigger-numbers","position":5},{"hierarchy":{"lvl1":"Representation of Numbers","lvl2":"Motivation"},"type":"lvl2","url":"/floats#motivation","position":6},{"hierarchy":{"lvl1":"Representation of Numbers","lvl2":"Motivation"},"content":"A number like \\pi = 3.14159265358979323846264338327950288419716939937510582097494459230 ... has infinitely many digits.\n\nIn practice, it only takes about 40 digits to compute the radius of the universe to within a hydrogen atom. There are 90 digits here, 50 are just showboating!","type":"content","url":"/floats#motivation","position":7},{"hierarchy":{"lvl1":"Representation of Numbers","lvl2":"Linearization"},"type":"lvl2","url":"/floats#linearization","position":8},{"hierarchy":{"lvl1":"Representation of Numbers","lvl2":"Linearization"},"content":"Text ::::{tab-set}\n:::{tab-item} MATLAB\n```MATLAB\nf=@(x) x^2\n```\n:::\n:::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n:::\n\n:::: ","type":"content","url":"/floats#linearization","position":9},{"hierarchy":{"lvl1":"The Condition Number"},"type":"lvl1","url":"/the-condition-number","position":0},{"hierarchy":{"lvl1":"The Condition Number"},"content":"Author: Jeremy Koch1,2 \\","type":"content","url":"/the-condition-number","position":1},{"hierarchy":{"lvl1":"The Condition Number","lvl2":"Motivation"},"type":"lvl2","url":"/the-condition-number#motivation","position":2},{"hierarchy":{"lvl1":"The Condition Number","lvl2":"Motivation"},"content":"HEYOOO :::{aside}\nhttps://en.wikipedia.org/wiki/Magnetic-core_memory\n:::  ::::{tab-set}\n:::{tab-item} MATLAB\n```MATLAB\nf=@(x) x^2\n```\n:::\n:::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n:::\n\n:::: ","type":"content","url":"/the-condition-number#motivation","position":3},{"hierarchy":{"lvl1":"Summary"},"type":"lvl1","url":"/zsummary","position":0},{"hierarchy":{"lvl1":"Summary"},"content":"Author: Jeremy Koch","type":"content","url":"/zsummary","position":1},{"hierarchy":{"lvl1":"Summary","lvl2":"Some things to think about..."},"type":"lvl2","url":"/zsummary#some-things-to-think-about","position":2},{"hierarchy":{"lvl1":"Summary","lvl2":"Some things to think about..."},"content":"\n\nA Riemann Zeta Function Question\n\nThe summation\\sum\\limits_{s=1}^\\infty \\frac{1}{2^s} = \\frac{\\pi^2}{6}.\n\nHowever, if you perform the summation from 1 to, say, 500, you will see a slight discrepancy from this value.\n\n(a) Is it just that 500 is not a large enough number to “fill out” the double? Note that \\pi^2/6 \\approx 1.6, and also recall that a double, represented in base-10, will have 15 digits. What value of s is the last that will affect the double representation of the sum?\n\n(b) Instead, we might evaluate the sum from 500 back to 1. It is more accurate... why?","type":"content","url":"/zsummary#some-things-to-think-about","position":3},{"hierarchy":{"lvl1":"Newton-Raphson Method (1D)"},"type":"lvl1","url":"/d-nr","position":0},{"hierarchy":{"lvl1":"Newton-Raphson Method (1D)"},"content":"Author: Jeremy Koch1,2 \\","type":"content","url":"/d-nr","position":1},{"hierarchy":{"lvl1":"Newton-Raphson Method (1D)","lvl2":"Motivation"},"type":"lvl2","url":"/d-nr#motivation","position":2},{"hierarchy":{"lvl1":"Newton-Raphson Method (1D)","lvl2":"Motivation"},"content":"The Newton-Raphson Method is another root-finding algorithm, though this one is called an “open” method because the search is not confined to a specific range. This has it’s positives -- most notably, it converges more quickly than the bisection method -- and negatives -- it is not guaranteed to find a solution, even if one exists, and also might find the “wrong” solution.","type":"content","url":"/d-nr#motivation","position":3},{"hierarchy":{"lvl1":"Newton-Raphson Method (1D)","lvl2":"Idea"},"type":"lvl2","url":"/d-nr#idea","position":4},{"hierarchy":{"lvl1":"Newton-Raphson Method (1D)","lvl2":"Idea"},"content":"The idea is this: we have a function for which we are seeking the location where f(x)=0, and we have a guess for the solution x_0, called the seed. We linearize the function around x_0 and trace the resulting line back to y=0. If our guess is decent and the function is not too erratic, it is likely that the associated x-location (call it x_1) is a better estimate of the root than our initial guess. We repeat the process, now linearizing around x=x_1 and tracing the line back to find an even better estimate, x_2, and then maybe we use that too get an even better estimate, etc.~etc.~etc., until we have acceptably converged.","type":"content","url":"/d-nr#idea","position":5},{"hierarchy":{"lvl1":"Newton-Raphson Method (1D)","lvl2":"Derivative"},"type":"lvl2","url":"/d-nr#derivative","position":6},{"hierarchy":{"lvl1":"Newton-Raphson Method (1D)","lvl2":"Derivative"},"content":"With our linearized function f(x) \\approx f(x_0)+ f'(x_0)(x-x_0), we can set f(x) =0 and rearrange to solve for x, the better guess for the root. Generalizing the algorithm:x_{i+1} = x_{i} - \\frac{f(x_i)}{f'(x_i)}\n\nwhere, during our first iteration, i=0. ::::{tab-set}\n:::{tab-item} MATLAB\n```MATLAB\nf=@(x) x^2\n```\n:::\n:::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n:::\n\n:::: ","type":"content","url":"/d-nr#derivative","position":7},{"hierarchy":{"lvl1":"Newton-Raphson Method (2+D)"},"type":"lvl1","url":"/d-nr-1","position":0},{"hierarchy":{"lvl1":"Newton-Raphson Method (2+D)"},"content":"Author: Jeremy Koch1,2 \\","type":"content","url":"/d-nr-1","position":1},{"hierarchy":{"lvl1":"Newton-Raphson Method (2+D)","lvl2":"Motivation"},"type":"lvl2","url":"/d-nr-1#motivation","position":2},{"hierarchy":{"lvl1":"Newton-Raphson Method (2+D)","lvl2":"Motivation"},"content":"We may have a situation in which a system of two variables needs solving:\\begin{align}\nf(x,y)&=0\\\\\ng(x,y)&=0.\n\\end{align}","type":"content","url":"/d-nr-1#motivation","position":3},{"hierarchy":{"lvl1":"Newton-Raphson Method (2+D)","lvl2":"Idea"},"type":"lvl2","url":"/d-nr-1#idea","position":4},{"hierarchy":{"lvl1":"Newton-Raphson Method (2+D)","lvl2":"Idea"},"content":"It is the same story as 1D Newton-Raphson.","type":"content","url":"/d-nr-1#idea","position":5},{"hierarchy":{"lvl1":"Newton-Raphson Method (2+D)","lvl2":"Derivative"},"type":"lvl2","url":"/d-nr-1#derivative","position":6},{"hierarchy":{"lvl1":"Newton-Raphson Method (2+D)","lvl2":"Derivative"},"content":"With our linearized function f(x) \\approx f(x_0)+ f'(x_0)(x-x_0), we can set f(x) =0 and rearrange to solve for x, the better guess for the root. Generalizing the algorithm:x_{i+1} = x_{i} - \\frac{f(x_i)}{f'(x_i)}\n\nwhere, during our first iteration, i=0.","type":"content","url":"/d-nr-1#derivative","position":7},{"hierarchy":{"lvl1":"Newton-Raphson Method (2+D)","lvl2":"Looking Forward"},"type":"lvl2","url":"/d-nr-1#looking-forward","position":8},{"hierarchy":{"lvl1":"Newton-Raphson Method (2+D)","lvl2":"Looking Forward"},"content":"The process of finding a matrix inverse is not mathematically trivial, though with the convenience of modern programming it sure seems to be that way. The next unit of the class will focus on problems that can be frames via matrix equations. ::::{tab-set}\n:::{tab-item} MATLAB\n```MATLAB\nf=@(x) x^2\n```\n:::\n:::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n:::\n\n:::: ","type":"content","url":"/d-nr-1#looking-forward","position":9},{"hierarchy":{"lvl1":"Root-Finding Methods Intro"},"type":"lvl1","url":"/root-finding-intro","position":0},{"hierarchy":{"lvl1":"Root-Finding Methods Intro"},"content":"Author: Jeremy Koch1,2 \\","type":"content","url":"/root-finding-intro","position":1},{"hierarchy":{"lvl1":"Root-Finding Methods Intro","lvl2":"Motivation"},"type":"lvl2","url":"/root-finding-intro#motivation","position":2},{"hierarchy":{"lvl1":"Root-Finding Methods Intro","lvl2":"Motivation"},"content":"Most of your work in traditional lecture classes involves pushing around equations until you can settle on something like:F = \\frac{\\pi}{2}\\rho U^2 R^2.\n\nThat is, you can usually “explicitly” solve for the variable you are interested using algebra. In practice, it doesn’t always work out so neatly. A classic example is the Colebrook Equation, which is used to determine the pressure drop in pipe flow:\\frac{1}{\\sqrt{p}} = -2 \\log\\left(\\frac{\\epsilon/D}{3.7}+\\frac{2.51}{\\text{Re}\\sqrt{p}}\\right)\n\nNotice that p appears both within the logarithm argument and outside the logarithm argument. This means it can’t be solved for explicitly... i.e., you cannot arrive at p=\\text{something} where the “something” is fundamental mathematical functions like \\exp, \\log, etc. To solve these problems, engineers have traditionally looked at a chart -- \n\nthe Moody Diagram. But we can also use “root-finding methods” to solve algebraic equations.\n\nThe Colebrook equation is usually written in terms of f, “the friction factor”, instead of p, but I want to avoid confusion with the f(x) below, which is just the standard “function of x”.","type":"content","url":"/root-finding-intro#motivation","position":3},{"hierarchy":{"lvl1":"Root-Finding Methods Intro","lvl2":"Root-Finding Algorithms"},"type":"lvl2","url":"/root-finding-intro#root-finding-algorithms","position":4},{"hierarchy":{"lvl1":"Root-Finding Methods Intro","lvl2":"Root-Finding Algorithms"},"content":"This type of problem could be called “algebraic equation solving”, but actually we need to use the special properties of zero in our algorithms. That is, we must examine an equation in the form f(x)=0, and we are finding the roots: the x-locations that make f(x)=0.\n\nAny equation, A(x)=B(x) can be turned into a root-finding problem by rearranging to A(x)-B(x)=0 and then working with f(x)\\equiv A(x)-B(x). For example, with the Colebrook Equation, we might manipulate it to\\frac{1}{\\sqrt{p}} +2 \\log\\left(\\frac{\\epsilon/D}{3.7}+\\frac{2.51}{\\text{Re}\\sqrt{p}}\\right) =0","type":"content","url":"/root-finding-intro#root-finding-algorithms","position":5},{"hierarchy":{"lvl1":"Root-Finding Methods Intro","lvl3":"Types of Root-Finding Methods","lvl2":"Root-Finding Algorithms"},"type":"lvl3","url":"/root-finding-intro#types-of-root-finding-methods","position":6},{"hierarchy":{"lvl1":"Root-Finding Methods Intro","lvl3":"Types of Root-Finding Methods","lvl2":"Root-Finding Algorithms"},"content":"There are two classes of root-finding methods:\n\n“Bracketed” methods are called as such because you place a lower and upper limit on your search range. These have a few downsides in general:\n\nYou must have some idea of where the root is located. (You could say it is like -999999 to 999999, but it would take a long time to arrive at the solution.)\n\nThey tend to be slow to converge.\n\nIf there are two roots within the range, the algorithm may break.\nHowever, at least if there is only one root within the brackets, it is guaranteed to find it.\n\n“Open” methods are called as such because their search range is not limited. The downsides are:\n\nThey are not guaranteed to find the root.\n\nThey may accidentally find “the wrong root”, e.g. you want the positive solution and it gives you a negative one.\n\nYou may need to do some prep work, e.g. calculating a derivative or rearranging f(x)=0 to something slightly different, a g(x)=0 (e.g., g(x)\\equiv f(x)/x... it is still equal to zero).\nHowever, they can converge more quickly than bracketed methods. Additionally, the main one we will discuss (Newton-Raphson) can be implemented in higher dimensions -- it does not only work for f(x)=0, it also works for f(x,y)=0 with g(x,y)=0, and further, with f(x,y,z)=0,g(x,y,z)=0,h(x,y,z)=0.\n\nEven higher dimensions too, but I don’t want to write it out! :::{aside}\nhttps://en.wikipedia.org/wiki/Magnetic-core_memory\n:::  ::::{tab-set}\n:::{tab-item} MATLAB\n```MATLAB\nf=@(x) x^2\n```\n:::\n:::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n:::\n\n:::: ","type":"content","url":"/root-finding-intro#types-of-root-finding-methods","position":7},{"hierarchy":{"lvl1":"Summary and some things to think about"},"type":"lvl1","url":"/zsummary-1","position":0},{"hierarchy":{"lvl1":"Summary and some things to think about"},"content":"Author: Jeremy Koch1,2 \\","type":"content","url":"/zsummary-1","position":1},{"hierarchy":{"lvl1":"Summary and some things to think about","lvl2":"Some things to think about..."},"type":"lvl2","url":"/zsummary-1#some-things-to-think-about","position":2},{"hierarchy":{"lvl1":"Summary and some things to think about","lvl2":"Some things to think about..."},"content":"If we wanted to find the solution to \\exp(x)=1.85 (and you didn’t know where the \\ln button was on your calculator), is the f(x) in our root-finding methods \\exp{x}?\n\nSketch f(x)=\\cos{x}-0.85. If we try to find the first positive root of this equation using Newton-Raphson, would a seed x_0=0 get us there? :::{aside}\nhttps://en.wikipedia.org/wiki/Magnetic-core_memory\n:::  ::::{tab-set}\n:::{tab-item} MATLAB\n```MATLAB\nf=@(x) x^2\n```\n:::\n:::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n:::\n\n:::: ","type":"content","url":"/zsummary-1#some-things-to-think-about","position":3},{"hierarchy":{"lvl1":"The Golden Search Method"},"type":"lvl1","url":"/golden","position":0},{"hierarchy":{"lvl1":"The Golden Search Method"},"content":" **Author:** Jeremy Koch<sup>1,2</sup> \\ ","type":"content","url":"/golden","position":1},{"hierarchy":{"lvl1":"The Golden Search Method","lvl2":"Motivation"},"type":"lvl2","url":"/golden#motivation","position":2},{"hierarchy":{"lvl1":"The Golden Search Method","lvl2":"Motivation"},"content":"","type":"content","url":"/golden#motivation","position":3},{"hierarchy":{"lvl1":"The Golden Search Method","lvl2":"Idea"},"type":"lvl2","url":"/golden#idea","position":4},{"hierarchy":{"lvl1":"The Golden Search Method","lvl2":"Idea"},"content":"","type":"content","url":"/golden#idea","position":5},{"hierarchy":{"lvl1":""},"type":"lvl1","url":"/opt-intro","position":0},{"hierarchy":{"lvl1":""},"content":"d","type":"content","url":"/opt-intro","position":1},{"hierarchy":{"lvl1":"DFDF"},"type":"lvl1","url":"/steepest","position":0},{"hierarchy":{"lvl1":"DFDF"},"content":"Author: Jeremy Koch1,2 \\","type":"content","url":"/steepest","position":1},{"hierarchy":{"lvl1":"DFDF","lvl2":"Motivation"},"type":"lvl2","url":"/steepest#motivation","position":2},{"hierarchy":{"lvl1":"DFDF","lvl2":"Motivation"},"content":"","type":"content","url":"/steepest#motivation","position":3},{"hierarchy":{"lvl1":"DFDF","lvl2":"Idea"},"type":"lvl2","url":"/steepest#idea","position":4},{"hierarchy":{"lvl1":"DFDF","lvl2":"Idea"},"content":"","type":"content","url":"/steepest#idea","position":5},{"hierarchy":{"lvl1":"Summary and some things to think about"},"type":"lvl1","url":"/zsummary-2","position":0},{"hierarchy":{"lvl1":"Summary and some things to think about"},"content":" **Author:** Jeremy Koch<sup>1,2</sup> \\ ","type":"content","url":"/zsummary-2","position":1},{"hierarchy":{"lvl1":"Summary and some things to think about","lvl2":"Some things to think about..."},"type":"lvl2","url":"/zsummary-2#some-things-to-think-about","position":2},{"hierarchy":{"lvl1":"Summary and some things to think about","lvl2":"Some things to think about..."},"content":"How would we modify the method of steepest ascent to find the minimum of a function?\n\nSuppose we have collected data on speed, but the equation we’d like to fit to is for kinetic energy: K=m V^2/2. So something like . We’ll assume that mass is known. How would we write a script that imports the data and prepares it to be fit to K(t)?","type":"content","url":"/zsummary-2#some-things-to-think-about","position":3},{"hierarchy":{"lvl1":"Intro to ODEs/PDEs"},"type":"lvl1","url":"/ode-intro","position":0},{"hierarchy":{"lvl1":"Intro to ODEs/PDEs"},"content":"Author: Jeremy Koch1,2 \\","type":"content","url":"/ode-intro","position":1},{"hierarchy":{"lvl1":"Intro to ODEs/PDEs","lvl2":"Motivation"},"type":"lvl2","url":"/ode-intro#motivation","position":2},{"hierarchy":{"lvl1":"Intro to ODEs/PDEs","lvl2":"Motivation"},"content":"You are maybe sensing a theme... a class like fluid mechanics might have you solve0=\\frac{d^2 u}{dz^2}\n\nsubject to two boundary conditions (since it is a second-order differential equation). Integrate twice and you have your functional form for u(z). But what about something like0=\\frac{d^2 x}{dt^2} -\\mu (1-x^2)\\frac{dx}{dt}+x\n\nwhich comes up when studying electrical circuits in vacuum tubes... apparently. That is a nonlinear differential equation, and there is no nice general solution. So... we’ll never know how it behaves? Nah, we just need to use a numerical technique!","type":"content","url":"/ode-intro#motivation","position":3},{"hierarchy":{"lvl1":"Intro to ODEs/PDEs","lvl2":"The ODE Problem Statement"},"type":"lvl2","url":"/ode-intro#the-ode-problem-statement","position":4},{"hierarchy":{"lvl1":"Intro to ODEs/PDEs","lvl2":"The ODE Problem Statement"},"content":"To put it generically, we might have :::{aside}\nhttps://en.wikipedia.org/wiki/Magnetic-core_memory\n:::  ::::{tab-set}\n:::{tab-item} MATLAB\n```MATLAB\nf=@(x) x^2\n```\n:::\n:::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n:::\n\n:::: ","type":"content","url":"/ode-intro#the-ode-problem-statement","position":5},{"hierarchy":{"lvl1":"Template"},"type":"lvl1","url":"/pde-intro","position":0},{"hierarchy":{"lvl1":"Template"},"content":"Author: Jeremy Koch1,2 \\","type":"content","url":"/pde-intro","position":1},{"hierarchy":{"lvl1":"Template","lvl2":"Binary"},"type":"lvl2","url":"/pde-intro#binary","position":2},{"hierarchy":{"lvl1":"Template","lvl2":"Binary"},"content":"“Computers are just a bunch of 1’s and 0’s” is absolutely true -- :::{aside}\nhttps://en.wikipedia.org/wiki/Magnetic-core_memory\n:::  ::::{tab-set}\n:::{tab-item} MATLAB\n```MATLAB\nf=@(x) x^2\n```\n:::\n:::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n:::\n\n:::: ","type":"content","url":"/pde-intro#binary","position":3},{"hierarchy":{"lvl1":"Coupled Differential Equations"},"type":"lvl1","url":"/coupled","position":0},{"hierarchy":{"lvl1":"Coupled Differential Equations"},"content":"","type":"content","url":"/coupled","position":1},{"hierarchy":{"lvl1":"Coupled Differential Equations","lvl2":"Implementing in your program"},"type":"lvl2","url":"/coupled#implementing-in-your-program","position":2},{"hierarchy":{"lvl1":"Coupled Differential Equations","lvl2":"Implementing in your program"},"content":"We wish to pass the set of coupled differential equations as a function argument. Here is how we might do it:\n\n\n[x,t]=RK4(f)\n\n\n???\n\n\n???","type":"content","url":"/coupled#implementing-in-your-program","position":3},{"hierarchy":{"lvl1":"Euler’s Method"},"type":"lvl1","url":"/eulers-method","position":0},{"hierarchy":{"lvl1":"Euler’s Method"},"content":"Author: Jeremy Koch1,2 \\","type":"content","url":"/eulers-method","position":1},{"hierarchy":{"lvl1":"Euler’s Method","lvl2":"Background"},"type":"lvl2","url":"/eulers-method#background","position":2},{"hierarchy":{"lvl1":"Euler’s Method","lvl2":"Background"},"content":"The linearized version of the Taylor Series :::{aside}\nhttps://en.wikipedia.org/wiki/Magnetic-core_memory\n:::  ::::{tab-set}\n:::{tab-item} MATLAB\n```MATLAB\nf=@(x) x^2\n```\n:::\n:::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n:::\n\n:::: ","type":"content","url":"/eulers-method#background","position":3},{"hierarchy":{"lvl1":"Template"},"type":"lvl1","url":"/runge-kutta","position":0},{"hierarchy":{"lvl1":"Template"},"content":"Author: Jeremy Koch1,2 \\","type":"content","url":"/runge-kutta","position":1},{"hierarchy":{"lvl1":"Template","lvl2":"Binary"},"type":"lvl2","url":"/runge-kutta#binary","position":2},{"hierarchy":{"lvl1":"Template","lvl2":"Binary"},"content":"“Computers are just a bunch of 1’s and 0’s” is absolutely true -- :::{aside}\nhttps://en.wikipedia.org/wiki/Magnetic-core_memory\n:::  ::::{tab-set}\n:::{tab-item} MATLAB\n```MATLAB\nf=@(x) x^2\n```\n:::\n:::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n:::\n\n:::: ","type":"content","url":"/runge-kutta#binary","position":3},{"hierarchy":{"lvl1":"Template"},"type":"lvl1","url":"/the-heat-equation","position":0},{"hierarchy":{"lvl1":"Template"},"content":"Author: Jeremy Koch1,2 \\","type":"content","url":"/the-heat-equation","position":1},{"hierarchy":{"lvl1":"Template","lvl2":"Binary"},"type":"lvl2","url":"/the-heat-equation#binary","position":2},{"hierarchy":{"lvl1":"Template","lvl2":"Binary"},"content":"“Computers are just a bunch of 1’s and 0’s” is absolutely true -- :::{aside}\nhttps://en.wikipedia.org/wiki/Magnetic-core_memory\n:::  ::::{tab-set}\n:::{tab-item} MATLAB\n```MATLAB\nf=@(x) x^2\n```\n:::\n:::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n:::\n\n:::: ","type":"content","url":"/the-heat-equation#binary","position":3},{"hierarchy":{"lvl1":"Template"},"type":"lvl1","url":"/zsummary-3","position":0},{"hierarchy":{"lvl1":"Template"},"content":"Author: Jeremy Koch1,2 \\","type":"content","url":"/zsummary-3","position":1},{"hierarchy":{"lvl1":"Template","lvl2":"Binary"},"type":"lvl2","url":"/zsummary-3#binary","position":2},{"hierarchy":{"lvl1":"Template","lvl2":"Binary"},"content":"“Computers are just a bunch of 1’s and 0’s” is absolutely true -- :::{aside}\nhttps://en.wikipedia.org/wiki/Magnetic-core_memory\n:::  ::::{tab-set}\n:::{tab-item} MATLAB\n```MATLAB\nf=@(x) x^2\n```\n:::\n:::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n:::\n\n:::: ","type":"content","url":"/zsummary-3#binary","position":3},{"hierarchy":{"lvl1":"Some thoughts on AI"},"type":"lvl1","url":"/ai-thoughts","position":0},{"hierarchy":{"lvl1":"Some thoughts on AI"},"content":"Author: Jeremy Koch","type":"content","url":"/ai-thoughts","position":1},{"hierarchy":{"lvl1":"Some thoughts on AI","lvl3":"Motivation"},"type":"lvl3","url":"/ai-thoughts#motivation","position":2},{"hierarchy":{"lvl1":"Some thoughts on AI","lvl3":"Motivation"},"content":"Optional reading, if you care to hear my opinions. On the technical aspects of how LLMs work, I am far from an expert. But when it comes to AI use in engineering education, including how that manifests in your early career, I have done a lot of thinking on this issue.","type":"content","url":"/ai-thoughts#motivation","position":3},{"hierarchy":{"lvl1":"Some thoughts on AI","lvl3":"What are LLMs doing?"},"type":"lvl3","url":"/ai-thoughts#what-are-llms-doing","position":4},{"hierarchy":{"lvl1":"Some thoughts on AI","lvl3":"What are LLMs doing?"},"content":"First, a bit of vocabulary.\n\nAI = artificial intelligence. This is a very broad idea that we, as a society, \n\nhave been thinking about for a long time.\n\nLLM = large language model. This was the recent breakthrough. Trained on massive amounts of text, they are “predictive” in the sense that, given a bit of text, they can guess what bit of text comes next based on their training.\n\nThere is debate about whether LLMs represent a form of artificial intelligence, or are they simply statistics calculators. I lean more towards the latter.\n\nToken == the calculation unit of LLMs. It is not quite a word.\n\nSo, a dismissive view of LLMs is that they are plagiarism machines, but maybe the blandest kind: they don’t steal from one author, they have a knowledge base that includes 50 authors who have written a similar bit of text. If 13 of them followed up that bit of text with with a similar idea, and the other 37 had unique ideas, it is ostensibly going to follow-up with some average of the 13 ideas. After all, that is the one that is statistically most likely, and therefore “correct”?!\n\nLet me emphasize again that I am not an expert on the technical side. I think a lot of the current research towards new models is about systematically examining the 37 other opinions, maybe in slightly different contexts, in order to judge if they should influence the output. When an LLM claims “PhD-level knowledge”, it is likely trying to cut through the large amounts of less-expert knowledge to find the one or two pieces of genuine-expert knowledge, and that is a tougher problem.","type":"content","url":"/ai-thoughts#what-are-llms-doing","position":5},{"hierarchy":{"lvl1":"Some thoughts on AI","lvl3":"Some readings"},"type":"lvl3","url":"/ai-thoughts#some-readings","position":6},{"hierarchy":{"lvl1":"Some thoughts on AI","lvl3":"Some readings"},"content":"The Atlantic has produced a steady stream of thought-provoking articles on AI use. Here are a few -- I don’t endorse the views in any of them, but they might help you to shape your opinions.\n\nThe Entry-Level Hiring Process Is Breaking Down.\n\n“In the past, companies looking for fresh entry-level talent could rely on a college graduate’s GPA as a mark of their intelligence and work ethic. Hiring managers could assess a candidate’s cover letter and interview performance to get a sense of their writing and communication skills. Now those signals have lost much of their value. Rampant grade inflation has rendered GPAs almost meaningless. The widespread use of AI to write cover letters—and even to assist with job-interview performance—has robbed those assessments of their predictive power.”\n\nThe Age of De-Skilling.\n\n\"\n\nMy Students Use AI. So What? :::{aside}\nhttps://en.wikipedia.org/wiki/Magnetic-core_memory\n:::  ::::{tab-set}\n:::{tab-item} MATLAB\n```MATLAB\nf=@(x) x^2\n```\n:::\n:::{tab-item} python\n```python\nf=lambda x: x**2\n```\n:::\n:::{tab-item} julia\n```julia\nf=lambda x: x**2\n```\n:::\n\n:::: ","type":"content","url":"/ai-thoughts#some-readings","position":7},{"hierarchy":{"lvl1":"Some thoughts on AI","lvl2":"AI in Computational Methods"},"type":"lvl2","url":"/ai-thoughts#ai-in-computational-methods","position":8},{"hierarchy":{"lvl1":"Some thoughts on AI","lvl2":"AI in Computational Methods"},"content":"Author: Jeremy Koch\n\nI could write many thousands of words on why AI is not good thing for students. Most notably: Who is going to hire an engineer who has outsourced all their thinking to AI? If I was looking to hire someone, I wouldn’t care that a lot of relevant information is readily available on ChatGPT, I am looking for someone who is comfortable with engineering, who can see the connections, who can troubleshoot problems, and who I’d feel excited to work with. “Hold on, let me see what ChatGPT says”... I can ask ChatGPT too, thanks for your time but I think we are going to hire someone else.\n\nAn engineer who is solid at the fundamentals can use AI to supercharge their abilities, but overuse of AI is preventing many students from becoming solid at the fundamentals.\n\nA class like MCEN 3030: Computational Methods is particularly vulnerable to AI misuse. As an example, the Newton-Raphson Method for determining the roots of a function has been known since the 1600’s. I don’t know .\n\nThis means that LLMs (large-language models) have for sure seen countless versions of the code on the internet, and so a simple prompt like “Write me python code that implements 1D Newton-Raphson” is going to give you a perfect implementation of the method.\n\nknown to engineersIt was probably one of the first things to appear on the internet.","type":"content","url":"/ai-thoughts#ai-in-computational-methods","position":9},{"hierarchy":{"lvl1":"Some thoughts on AI","lvl3":"Course design","lvl2":"AI in Computational Methods"},"type":"lvl3","url":"/ai-thoughts#course-design","position":10},{"hierarchy":{"lvl1":"Some thoughts on AI","lvl3":"Course design","lvl2":"AI in Computational Methods"},"content":"As I thought about designing the course, a few things were on my mind.\n\nI could officially prohibit AI. This would involve a lot of police-work on my end, which I have no appetite for, and it would likely lead to an adversarial relationship between me and you. I for sure don’t want that.\n\nI am uncomfortable with the fact that a student who has misused AI may receive a higher grade than an earnest student who made a few mistakes along the way. While I, and many employers, are seeing less meaning in grades, I still don’t like that.\n\n","type":"content","url":"/ai-thoughts#course-design","position":11},{"hierarchy":{"lvl1":"Some thoughts on AI","lvl3":"Practically...","lvl2":"AI in Computational Methods"},"type":"lvl3","url":"/ai-thoughts#practically","position":12},{"hierarchy":{"lvl1":"Some thoughts on AI","lvl3":"Practically...","lvl2":"AI in Computational Methods"},"content":"You have the green-light to use AI on homework and projects in this course. Pencil-and-paper work, including the in-class problems and exams, are technology-free -- no AI. I therefore encourage you to judiciously AI to debug your work, explain error messages, generate example applications, etc. Additionally, it may be essential to use AI on the machine learning project in this class.\n\nI strongly discourage using AI to write your code from scratch, or even to give you a “skeleton”/outline of the code. It is possible, and many of your colleagues did it in recent semesters. By devaluing this course, they missed out on an opportunity to grow as engineers.\n\nI am hearing stories about students in tech electives/senior design who are running code, writing down the output on a piece of paper, changing the code and rerunning, writing that result down, changing the code and rerunning, writing that result down, ... . Didn’t know how to add the three or fours lines to automate this entirely. I am kinda embarrassed: some of them probably passed my MCEN 3030 course.","type":"content","url":"/ai-thoughts#practically","position":13},{"hierarchy":{"lvl1":"Some thoughts on AI","lvl3":"If I am not going to police AI use...","lvl2":"AI in Computational Methods"},"type":"lvl3","url":"/ai-thoughts#if-i-am-not-going-to-police-ai-use","position":14},{"hierarchy":{"lvl1":"Some thoughts on AI","lvl3":"If I am not going to police AI use...","lvl2":"AI in Computational Methods"},"content":"... the responsibility shifts to the students to understand what amount is too much. A good starting point: If you would be hesitant to show me your prompts, you probably went too far.\n\nWarning\n\nSomeone will use AI to complete every homework problem in this class and will pass the exams. Presumably, this person will have a good computer science foundation and/or they responsibly used AI.\n\nSomeone will use AI to complete every homework problem in this class and will fail the exams.\n\nAnother someone will claim that they “only” used AI to debug, or to “get started”, or that they used AI but really tried to understand the output, yet they too will fail the exams. I will be a bit sympathetic, but won’t change the grades. Understanding a solution is a VERY different mental process than being able to produce a solution -- you do not want to be the one to learn this the hard way.\n\nThere will be no test re-dos, no extra credit, and probably won’t be much of a curve. Don’t ask.","type":"content","url":"/ai-thoughts#if-i-am-not-going-to-police-ai-use","position":15},{"hierarchy":{"lvl1":"Taylor Series Refresher"},"type":"lvl1","url":"/taylor-series","position":0},{"hierarchy":{"lvl1":"Taylor Series Refresher"},"content":"Author: Jeremy Koch","type":"content","url":"/taylor-series","position":1},{"hierarchy":{"lvl1":"Taylor Series Refresher","lvl2":"The Taylor Series"},"type":"lvl2","url":"/taylor-series#the-taylor-series","position":2},{"hierarchy":{"lvl1":"Taylor Series Refresher","lvl2":"The Taylor Series"},"content":"Suppose we have a complicated function f(x), made of natural logs and arctangents or whatever. Not friendly to deal with. We could reasonably ask the question: if there is another function \\hat{f}(x) that has the same value as f(x) at x=x_0, and the same value of the first derivative (so the value of \\hat{f}(x) is changing just as rapidly as f(x) at x=x_0), and the same value of the second derivative (so the rate of change of the rate of change of \\hat{f}(x) matches that of f(x)), and the same value of the third derivative, and the same value of the fourth derivative, etc., onwards to the infinitieth derivative... well, that sounds like we effectively have the same functional behavior for both f(x) and \\hat{f}(x). A function that meets this requirement can usually be constructed:\\begin{align}\n\\hat{f}(x) &= f(x_0)+ (x-x_0)f'(x_0) + \\frac{1}{2!}(x-x_0)^2f''(x_0) + \\frac{1}{3!}(x-x_0)^3f'''(x_0) \\dots \\\\\n& = f(x_0) + \\sum\\limits_{n=1}^\\infty \\frac{1}{n!}(x-x_0)^nf^{(n)}(x_0)\n\\end{align}\n\nout to infinity terms with f^{(n)} being the nth derivative. Importantly, this equivalent function, \\hat{f}(x), is a polynomial, and polynomials are easy to deal with! The trade-off, of course, is that there are now infinity terms. We’ll see if we can tame that.","type":"content","url":"/taylor-series#the-taylor-series","position":3},{"hierarchy":{"lvl1":"Taylor Series Refresher","lvl2":"Truncation Error"},"type":"lvl2","url":"/taylor-series#truncation-error","position":4},{"hierarchy":{"lvl1":"Taylor Series Refresher","lvl2":"Truncation Error"},"content":"In practice, we (either by hand our with a computer) cannot process infinity terms, and so we must “truncate” the summation\nWe could characterize the error between the original function f(x) and the equivalent polynomial \\hat{f}(x) at an arbitrary point x via\\text{error} = f(x) - \\hat{f}(x) = f(x) - \\left[f(x_0)+ f'(x_0)(x-x_0) + \\dots \\right]","type":"content","url":"/taylor-series#truncation-error","position":5},{"hierarchy":{"lvl1":"Taylor Series Refresher","lvl2":"Linearization"},"type":"lvl2","url":"/taylor-series#linearization","position":6},{"hierarchy":{"lvl1":"Taylor Series Refresher","lvl2":"Linearization"},"content":"Let’s suppose x-x_0=\\epsilon, where \\epsilon \\ll 1. To make it concrete, let’s say \\epsilon=0.1. What is the value, then, of (x-x_0)^2 = \\epsilon^2? It is small: 0.01. And (x-x_0)^3 = \\epsilon^3? Even smaller, 0.001. This tells us that, presuming the function\n\nThe most important lesson we learn from Taylor Series is how to approximate a function as a line, at least “near” to a point. Notice that in the “full” Taylor Series x+4","type":"content","url":"/taylor-series#linearization","position":7},{"hierarchy":{"lvl1":"Keys to Success (not just in 3030)"},"type":"lvl1","url":"/success","position":0},{"hierarchy":{"lvl1":"Keys to Success (not just in 3030)"},"content":" **Author:** Jeremy Koch \n\nI speculate that your career success will be correlated with your ability to focus for long periods of time.\n\nBeing an engineer is not about “trivia”, memorizing terms . It is about being able to carry out a careful analysis that may take hours or days or weeks to assemble.\n\nI am guilty of this too -- I’ll scroll on instagram for an hour, and probably see 200+ short videos in that time.\n\nPassivity is getting you nowhere.\n\nPart of the reason I implemented a “flipped” classroom\" in 3030 is that I have watched students become increasingly passive in this course. You are not an empty vessel that is getting filled when I talk, you need to be actively doing things to learn. Think about the material and make the connections -- the point of homework is to help you do that! Don’t think of homework as a task that needs to be completed as quickly as possible, it should take however long it takes for you to understand the content. One thing I do in office hours, which may not be perceived well but I genuinely believe in, is to ask that students explain things to each other. If I tell you the answer, it is perceived as the absolute, inarguable truth, and you will not think about it as hard. If your friend tells you an answer, you are a bit more suspicious, or maybe you both are a little uncertain, and that leads to more thinking and more discussion. \n\nAlso: this is a bit about AI. AI is letting students skip class and complete homework with near-zero effort.\n\nAI is a tool that amplifies your skills.\n\nIf you do not have a skill, it cannot be amplified.\n\nAI is letting students\n\nIt is very unlikely you will have a successful career as an engineer if you are looking up almost everything on ChatGPT.\n\nGet the easy stuff right.\n\nAttending class and office hours. Submitting your work on time. \n\nCommunicating in a professional way. Staying off social media in class. Not watching soccer in class (yes, this happens). Showing up to exams with a pencil (yes, this too). These things are not hard. Get the easy stuff right and the hard stuff won’t be as hard and/or you will actually reap the full rewards from your hard work.\n\nI cannot care more about your success than you do.\n\nThis has at least two facets: (1) I\n\nI have had dozens of students whose exam grades are 90+%, but who consistently skip homework or turn it in late, and they end up scraping by with a C. It drives me crazy, but maybe that\n\nAnd (2) the college degree -- specifically the piece of paper that says your name and “batchelor of science” -- used to be a sign that the recipient was qualified to be a mechanical engineer, and a company would recognize . With so much AI use in college these days, that is becoming decreasingly true. The college environment itself is still valuable -- our department has many excellent teachers, . I care that your degree is meaningful, do you?\n\nOne more: mechanical engineering is awesome, and coding is awesome. \n\nJudith Love Cohen","type":"content","url":"/success","position":1}]}